<pad>	0
<sos>	1
<eos>	2
<unk>	3
Module	4
body	5
Expr	6
value	7
Call	8
func	9
Attribute	10
Name	11
session	12
delete	13
args	14
page	15
keywords	16
json	17
dumps	18
DictComp	19
key	20
str	21
k	22
v	23
generators	24
comprehension	25
target	26
Tuple	27
elts	28
iter	29
data	30
items	31
ifs	32
getattr	33
x	34
Assign	35
targets	36
rows	37
Subscript	38
soup	39
findAll	40
Str	41
tr	42
slice	43
Slice	44
lower	45
Num	46
4	47
upper	48
step	49
5	50
l	51
GeneratorExp	52
elt	53
int	54
s	55
split	56
select	57
df	58
groupby	59
index	60
sum	61
List	62
0	63
1000	64
Index	65
BrandName	66
replace	67
ABC	68
AB	69
A	70
If	71
test	72
Compare	73
left	74
find	75
is	76
ops	77
Eq	78
comparators	79
UnaryOp	80
op	81
USub	82
operand	83
1	84
print	85
orelse	86
sorted	87
mylist	88
keyword	89
Lambda	90
arguments	91
arg	92
annotation	93
vararg	94
kwonlyargs	95
kw_defaults	96
kwarg	97
defaults	98
order	99
os	100
system	101
ListComp	102
el	103
a	104
b	105
c	106
d	107
re	108
sub	109
values	110
tolist	111
time	112
sleep	113
60	114
round	115
Dict	116
keys	117
2	118
3	119
i	120
BinOp	121
Add	122
right	123
range	124
len	125
ID	126
dict	127
iterable	128
join	129
format	130
val	131
:	132
stat	133
df2	134
pd	135
DataFrame	136
df1	137
16	138
foo	139
Starred	140
plt	141
size	142
30	143
isinstance	144
e	145
append	146
f	147
g	148
h	149
hex	150
__file__	151
random	152
choice	153
list	154
Set	155
item	156
date	157
BitOr	158
my_string	159
,	160
loc	161
column_name	162
any	163
2010	164
12	165
31	166
relativedelta	167
gca	168
Lt	169
Gt	170
r	171
requests	172
post	173
url	174
driver	175
itertools	176
product	177
drop	178
level	179
axis	180
In	181
execute	182
map	183
permutations	184
lst2	185
enumerate	186
lst	187
__name__	188
NFKD	189
title	190
encode	191
ascii	192
ignore	193
set_index	194
NameConstant	195
True	196
line	197
concat	198
Mult	199
10	200
*	201
text	202
n	203
set	204
list1	205
list2	206
sublist	207
mystring	208
objects	209
filter	210
urllib	211
parse	212
unquote	213
walk	214
directory	215
k_v	216
reverse	217
reset_index	218
merge	219
y	220
how	221
on	222
state	223
sort	224
False	225
min	226
abs	227
Sub	228
np	229
mean	230
array	231
cursor	232
query	233
User	234
id	235
123	236
update	237
name	238
strip	239
findall	240
str1	241
myDict	242
str_list	243
Peak	244
Weeks	245
ascending	246
inplace	247
string	248
X	249
For	250
Pass	251
OrderedDict	252
t	253
getarray	254
8	255
example	256
to_datetime	257
Series	258
logging	259
info	260
num	261
glob	262
rstrip	263
[LINE]	264
dt	265
datetime	266
timedelta	267
hours	268
shape	269
next	270
MyModel	271
gold	272
example_list	273
chain	274
from_iterable	275
B	276
C	277
self	278
group	279
var1	280
var2	281
var3	282
utcnow	283
numpy	284
max	285
{0:.2f}	286
13.95	287
my_list	288
psutil	289
word	290
browser	291
hasattr	292
property	293
rfind	294
&	295
strptime	296
rename	297
columns	298
_	299
where	300
isdigit	301
emaillist	302
queryresult	303
environ	304
get	305
KEY_THAT_MIGHT_EXIST	306
Mod	307
open	308
write	309
matrix	310
HOME	311
ExtSlice	312
dims	313
NotEq	314
zip	315
pandas	316
read_csv	317
filename	318
sep	319
path	320
content	321
tuple	322
testdata	323
reversed	324
new_list	325
parser	326
input	327
+	328
my_dict	329
resultType	330
BeautifulSoup	331
div	332
class	333
container	334
isfile	335
fname	336
and	337
/	338
load	339
sample.json	340
utf-8-sig	341
sort_values	342
exec	343
compile	344
file.py	345
read	346
letter	347
Raise	348
exc	349
cause	350
three	351
four	352
five	353
all	354
BoolOp	355
Not	356
m	357
Date	358
apply	359
With	360
withitem	361
context_expr	362
optional_vars	363
words	364
IfExp	365
startswith	366
math	367
a_list	368
operator	369
itemgetter	370
-1	371
root	372
score	373
copy	374
file.txt	375
L	376
Hello	377
to_csv	378
realpath	379
7	380
j	381
agg	382
utf-16	383
decode	384
subprocess	385
names	386
alias	387
call	388
asname	389
dir	390
Return	391
user	392
exists	393
10000	394
Delete	395
6	396
p	397
ind	398
ax	399
xaxis	400
top	401
strftime	402
%Y-%m-%d	403
outer	404
now	405
11	406
year	407
genfromtxt	408
delimiter	409
html_text	410
one	411
\1	412
100	413
randint	414
9	415
my_function	416
request	417
datafile	418
file	419
example.txt	420
blabla	421
pattern	422
stats	423
astype	424
float	425
it	426
-	427
;	428
ctime	429
getmtime	430
my_date	431
list_a	432
list_b	433
einsum	434
f233op	435
img	436
bigdict	437
T	438
sentence	439
search	440
\d+	441
default_data	442
item3	443
abspath	444
globals	445
myfunction	446
month	447
day	448
utf-8	449
•	450
plot	451
--	452
o	453
color	454
hello	455
pop	456
rb	457
some_string	458
sys	459
stdout	460
eval	461
some	462
of	463
vars	464
=	465
headers	466
translate	467
dirnames	468
filenames	469
Try	470
doSomething	471
handlers	472
ExceptHandler	473
type	474
finalbody	475
Div	476
bool	477
char	478
rsplit	479
dict1	480
functools	481
reduce	482
name_num	483
pid	484
aaabcabccd	485
myList	486
\	487
string1	488
string2	489
S	490
dirname	491
some_list	492
2013-1-25	493
cat	494
dog	495
in1d	496
a1	497
a2	498
GOOG	499
AAPL	500
Counter	501
start	502
key1	503
.	504
ab	505
dot	506
NotIn	507
legend	508
BitAnd	509
output	510
chdir	511
UTF8	512
count	513
xpath	514
files	515
listdir	516
match	517
myfile.csv	518
dtype	519
revenue	520
pluto	521
file.gz	522
find_element_by_css_selector	523
struct	524
unpack	525
dicts	526
savefig	527
22	528
ValueError	529
conn	530
r1	531
command	532
result	533
today	534
myVar	535
ord	536
[	537
]	538
frozenset	539
HttpResponse	540
click	541
u	542
clear	543
DEBUSSY	544
$	545
results	546
dic	547
setdefault	548
number	549
utf8	550
20M10000N80M	551
super	552
something	553
bob	554
first	555
String	556
json_string	557
sample	558
deadbeef	559
shell	560
seq	561
IsNot	562
50	563
shutdown	564
exit	565
Invert	566
isin	567
alist	568
username	569
fillna	570
bin	571
Test	572
x1	573
x2	574
%.2f	575
pivot_table	576
isoformat	577
final_choices	578
another_choice	579
my_choices	580
to_dict	581
Value	582
arange	583
w	584
/r	585
string_escape	586
filename.py	587
myString	588
your_list	589
15	590
concatenate	591
platform	592
obj	593
order_by	594
?	595
17	596
dict2	597
listone	598
listtwo	599
unicode-escape	600
20	601
{	602
}	603
stock	604
same1	605
same2	606
positions	607
LoD	608
/etc/password.txt	609
file_name	610
#	611
Y	612
d2	613
d1	614
display.max_columns	615
list_of_tuples	616
tup	617
mydict	618
l1	619
Popen	620
dictList	621
Exception	622
old_list	623
two	624
pair	625
row	626
reshape	627
bar	628
elem	629
Task	630
P	631
mycsv.csv	632
grep	633
PIPE	634
stdin	635
communicate	636
apple	637
banana	638
pack	639
existGDBPath	640
example.yaml	641
stream	642
yaml	643
var	644
element	645
floats	646
KeyError	647
D	648
inner	649
myNumber	650
lines	651
somekey	652
baz	653
'	654
substring	655
0.1	656
0.05	657
0.2	658
999999999999	659
endswith	660
filename.png	661
second	662
last	663
key2	664
I	665
<	666
std	667
x_y	668
!	669
loads	670
col	671
200	672
repeat	673
unique	674
li	675
^	676
include	677
sms.urls	678
updated	679
None	680
z	681
utf-16-le	682
chr	683
AndrÃ©	684
sdfasdf	685
unicode_escape	686
arr	687
isnan	688
insert	689
M	690
ch	691
test2.py	692
find_element_by_xpath	693
ls	694
G	695
flt	696
wi	697
response	698
length	699
columnX	700
ham	701
spam	702
l2	703
/usr/var	704
/etc	705
my.csv	706
n/a	707
beginning	708
Z	709
yourdata	710
subkey	711
City	712
pdffile	713
hash	714
pformat	715
src	716
dst	717
_f	718
.c	719
\\	720
2011	721
/the/dir/	722
the_list	723
a_string	724
42	725
|	726
.com	727
workbook	728
buf_size	729
1024	730
read_f	731
buf	732
mask	733
full_path	734
thisismylist	735
strings	736
Error	737
data_df	738
grade	739
fn	740
my_file	741
success	742
thelist	743
find_all	744
@	745
subdirname	746
weight	747
suffix	748
picture.jpg	749
factor	750
input_list	751
each	752
cp1252	753
/does/not/exist	754
Tag	755
vf	756
you	757
Joe	758
contains	759
World	760
-c	761
myfile.txt	762
listD	763
td	764
Python	765
ins	766
(	767
)	768
json.dumps	769
for	770
in	771
data.items	772
soup.findAll	773
s.split	774
df.groupby	775
df.index	776
.sum	777
.replace	778
if	779
==	780
``	781
here	782
else	783
the	784
key=lambda	785
order.index	786
os.system	787
with	788
re.sub	789
time.sleep	790
.join	791
.format	792
pd.DataFrame	793
**	794
.append	795
random.choice	796
d.items	797
df.loc	798
>	799
itertools.product	800
df.drop	801
axis=1	802
%	803
http	804
.encode	805
df.set_index	806
pd.concat	807
:-1	808
urllib.parse.unquote	809
os.walk	810
reverse=True	811
how=	812
on=	813
np.array	814
axis=0	815
cursor.execute	816
INSERT	817
INTO	818
table	819
VALUES	820
session.query	821
.update	822
s.strip	823
re.findall	824
df.sort	825
ascending=	826
inplace=True	827
pass	828
pd.to_datetime	829
pd.Series	830
logging.info	831
.rstrip	832
datetime.timedelta	833
lambda	834
.mean	835
:2	836
.2f	837
datetime.datetime.strptime	838
Y-	839
m-	840
H	841
columns=	842
np.where	843
.date	844
\\w+	845
\\s	846
sep=	847
\t	848
my_dict.items	849
os.path.isfile	850
datetime.strptime	851
df.sort_values	852
.read	853
raise	854
not	855
.apply	856
as	857
key=operator.itemgetter	858
Total	859
.strip	860
str.find	861
df.to_csv	862
os.path.realpath	863
.agg	864
.decode	865
import	866
.split	867
return	868
del	869
pd.merge	870
datetime.datetime.now	871
.strftime	872
delimiter=	873
d.values	874
\\1	875
random.randint	876
re.compile	877
\\d+	878
re.split	879
.str	880
.str.split	881
.astype	882
pd.read_csv	883
time.ctime	884
os.path.getmtime	885
np.einsum	886
a-z	887
.T	888
re.search	889
.group	890
os.path.abspath	891
itertools.groupby	892
key=itemgetter	893
-2	894
requests.get	895
.index	896
mylist.sort	897
try	898
except	899
subprocess.call	900
...	901
.size	902
.reset_index	903
\\w	904
A-Z	905
os.path.dirname	906
k.lower	907
My	908
d/	909
.tolist	910
np.in1d	911
os.chdir	912
x.split	913
.//a	914
os.listdir	915
re.match	916
0-9	917
driver.find_element_by_css_selector	918
struct.unpack	919
plt.savefig	920
a.shape	921
echo	922
.click	923
os.environ	924
np.all	925
level=0	926
df.columns	927
random.sample	928
shell=True	929
sys.exit	930
index=	931
.isoformat	932
m/	933
np.arange	934
your	935
to	936
.order_by	937
df.apply	938
M\\N	939
os.path.exists	940
mydict.items	941
os.path.join	942
subprocess.Popen	943
\\d	944
struct.pack	945
\\b	946
\x00\x00\x80	947
this	948
json.loads	949
.*	950
df.values	951
.reshape	952
.+	953
s.encode	954
driver.find_element_by_xpath	955
s.decode	956
itertools.chain	957
This	958
soup.find_all	959
1,3	960
