<pad>	0
<sos>	1
<eos>	2
<unk>	3
tell	4
me	5
what	6
the	7
notes	8
are	9
for	10
south[SEP]australia	11
is	12
where	13
?	14
format	15
name	16
state[SEP]/[SEP]territory	17
how	18
many	19
times	20
fuel[SEP]propulsion	21
fleet[SEP]series[SEP]([SEP]quantity[SEP])	22
who	23
manufacturer	24
order[SEP]year	25
1998	26
model	27
when	28
2000	29
if	30
description	31
of	32
a	33
school[SEP]/[SEP]club[SEP]team	34
did	35
player	36
number	37
6	38
come	39
from	40
that	41
has	42
been	43
years[SEP]in[SEP]toronto	44
go	45
to	46
position	47
baylor	48
play	49
played	50
raptors	51
1995[SEP]-[SEP]96	52
which	53
was	54
does	55
have	56
2001[SEP]-[SEP]02	57
2004[SEP]-[SEP]05	58
attend	59
country	60
went	61
during	62
period	63
'	64
s	65
nationality	66
georgia	67
connecticut	68
positions	69
were	70
2004	71
players	72
with	73
or	74
la[SEP]salle	75
117	76
,	77
best[SEP]finish	78
people	79
came	80
in	81
2nd	82
wins	83
there	84
money[SEP]list[SEP]rank	85
183	86
n[SEP]/[SEP]a	87
scoring[SEP]average	88
time	89
highest	90
their	91
first	92
rookie	93
year	94
winner	95
college	96
teams	97
had	98
draft[SEP]pick[SEP]#	99
1	100
won	101
award	102
10	103
years[SEP]played	104
singles[SEP]w[SEP]-[SEP]l	105
3[SEP]–[SEP]2	106
doubles[SEP]w[SEP]-[SEP]l	107
0[SEP]–[SEP]0	108
and	109
3[SEP]–[SEP]1	110
value	111
375	112
whose	113
"	114
direction	115
guardian	116
weapon	117
used	118
by	119
east	120
listed	121
headquarters	122
members	123
classification	124
member	125
12	126
1934	127
all	128
4	129
293	130
1929	131
schools	132
founded	133
capital[SEP]([SEP]endonym[SEP])	134
countries	135
country[SEP]([SEP]endonym[SEP])	136
country[SEP]([SEP]exonym[SEP])	137
official[SEP]or[SEP]native[SEP]language[SEP]([SEP]s[SEP])[SEP]([SEP]alphabet[SEP]/[SEP]script[SEP])	138
icelandic	139
season[SEP]premiere	140
aired	141
on	142
networks	143
ranking	144
season[SEP]finale	145
minimum	146
population[SEP]canada[SEP]2011[SEP]census	147
being	148
population	149
county	150
english[SEP]name	151
irish[SEP]name	152
62[SEP]%	153
53[SEP]%	154
chinese	155
state	156
states	157
an	158
australia	159
it	160
65	161
tv[SEP]season	162
million	163
views	164
rank	165
39	166
premieres	167
watched	168
2012	169
average	170
avg[SEP].[SEP]finish	171
happened	172
1983	173
top[SEP]10	174
avg[SEP].[SEP]start	175
29[SEP].[SEP]4	176
poles	177
19[SEP].[SEP]1	178
starts	179
nhl[SEP]team	180
centre	181
florida[SEP]panthers	182
.	183
united[SEP]states	184
smaller	185
pick	186
than	187
college[SEP]/[SEP]junior[SEP]/[SEP]club[SEP]team	188
do	189
st[SEP].[SEP]louis[SEP]blues	190
high	191
school	192
votes	193
cast	194
northern[SEP]ireland	195
3	196
lowest	197
scotland	198
total	199
35	200
wales	201
9	202
top[SEP]5	203
hartford[SEP]whalers	204
smallest	205
new[SEP]york[SEP]islanders	206
vacator	207
district	208
notion	209
formula	210
done	211
city	212
region	213
bigger	214
13	215
nationalities	216
formally	217
installed	218
songs	219
received	220
rated	221
tonioli	222
score	223
give	224
safe	225
results	226
7	227
31	228
dance[SEP]/[SEP]song	229
samba[SEP]/[SEP]young[SEP]hearts[SEP]run[SEP]free	230
second[SEP]place	231
scores	232
year[SEP]built	233
we[SEP]two	234
points	235
driver	236
mark[SEP]martin	237
maximum	238
winnings	239
actor	240
film[SEP]name	241
nominated	242
actors[SEP]name	243
best[SEP]actress[SEP]in[SEP]a[SEP]leading[SEP]role	244
chopin:[SEP]desire[SEP]for[SEP]love	245
films	246
best[SEP]actor[SEP]in[SEP]a[SEP]supporting[SEP]role	247
serbia	248
worked	249
film	250
earned	251
nomination	252
ukraine	253
directed	254
make	255
total[SEP]goals	256
fa[SEP]cup[SEP]goals	257
fa[SEP]cup[SEP]apps	258
circuit	259
race	260
fastest[SEP]lap	261
production[SEP]code	262
title	263
episode[SEP]#	264
directed[SEP]by	265
movie	266
written[SEP]by	267
whatis	268
temperature	269
possible	270
use	271
matches	272
partner	273
matched	274
scored	275
match	276
champion	277
opponents	278
party	279
birthday	280
date[SEP]of[SEP]birth	281
representative	282
singles[SEP]w[SEP]–[SEP]l	283
-	284
named	285
before	286
part	287
after	288
character	289
broadcast[SEP]date	290
greater	291
then	292
years	293
20th	294
original[SEP]title	295
titles	296
year[SEP]([SEP]ceremony[SEP])	297
submitted	298
operational	299
overall	300
240	301
round	302
at	303
255	304
player[SEP]name	305
chosen	306
17	307
record	308
7[SEP]-[SEP]3	309
largest	310
attendance	311
9[SEP]-[SEP]4	312
against	313
opponent	314
game	315
8	316
drafted	317
top	318
n	319
draft	320
quarterback	321
plays	322
linebacker	323
illinois	324
greatest	325
83	326
>	327
rice	328
defensive[SEP]back	329
appear	330
bullet[SEP]tip[SEP]color	331
colors	332
white	333
touchdowns	334
percentage	335
completions	336
recorded	337
games[SEP]started	338
348	339
attempts	340
characters	341
person	342
london	343
class[SEP]aaa	344
school[SEP]year	345
same	346
class[SEP]a	347
class[SEP]aaaaa	348
class[SEP]aa	349
records	350
week	351
game[SEP]site	352
original[SEP]air[SEP]date	353
episode	354
set	355
29	356
season	357
wrote	358
no[SEP].[SEP]in[SEP]season	359
lasts	360
duration	361
song	362
date	363
lyricist	364
3:50	365
playoffs	366
league	367
division	368
1[SEP]st[SEP]round	369
team	370
series	371
podiums	372
2010	373
podium	374
144	375
writers	376
no[SEP].	377
25	378
regular[SEP]season	379
2011	380
11	381
as	382
called	383
#	384
villains	385
titled	386
appeared	387
episodes	388
director	389
written	390
species	391
petal[SEP]width	392
2[SEP].[SEP]0	393
4[SEP].[SEP]9	394
sepal[SEP]width	395
5[SEP].[SEP]1	396
3[SEP].[SEP]4	397
sepal[SEP]length	398
5[SEP].[SEP]4	399
2[SEP].[SEP]8	400
6[SEP].[SEP]5	401
2[SEP].[SEP]2	402
2[SEP].[SEP]9	403
1[SEP].[SEP]3	404
you	405
whom	406
writer	407
report	408
while	409
al[SEP]unser	410
pole[SEP]position	411
winning[SEP]team	412
1926	413
1930	414
venezuela	415
only	416
admits[SEP]boys[SEP]/[SEP]girls	417
both	418
1972	419
but	420
became	421
until	422
1977	423
(	424
)	425
introduced	426
maximum[SEP]memory	427
presenter	428
bulgaria	429
winners	430
most	431
cup[SEP]goals	432
league[SEP]apps	433
premier	434
1970	435
runner[SEP]-[SEP]up	436
richmond	437
12[SEP].[SEP]2	438
miles	439
long	440
amount	441
owners	442
construction	443
build[SEP]date	444
can	445
find	446
train	447
built	448
wheels	449
owned	450
men	451
blazers	452
joined	453
women	454
left	455
enrollment	456
1500	457
current[SEP]conference	458
location	459
institution	460
1866	461
type	462
date[SEP]of[SEP]vacancy	463
date[SEP]of[SEP]appointment	464
replaced[SEP]by	465
manchester[SEP]city	466
position[SEP]in[SEP]table	467
pre[SEP]-[SEP]season	468
games	469
post	470
play[SEP]-[SEP]off	471
any	472
totaled	473
up	474
reached	475
6[SEP]-[SEP]9	476
institutions	477
located	478
private	479
dates	480
dates[SEP]active	481
storm	482
death	483
equal	484
deaths	485
high[SEP]score	486
120	487
50	488
2	489
0	490
inns	491
21	492
general[SEP]election	493
%[SEP]of[SEP]popular[SEP]vote	494
least	495
#[SEP]of[SEP]candidates	496
running	497
80	498
#[SEP]of[SEP]seats[SEP]won	499
election	500
125	501
weeks	502
attended	503
indianapolis[SEP]colts	504
0[SEP]-[SEP]4	505
stadium	506
corresponds	507
last	508
one	509
be	510
5	511
probability[SEP]1[SEP]st[SEP]player[SEP]wins	512
probability[SEP]of[SEP]a[SEP]draw	513
2nd[SEP]players[SEP]choice	514
second	515
probability[SEP]2nd[SEP]player[SEP]wins	516
chance	517
winning	518
will	519
win	520
nfl[SEP]team	521
pick[SEP]#	522
defensive[SEP]tackle	523
province	524
density	525
area[SEP]([SEP]km²[SEP])	526
place	527
gdp[SEP]([SEP]2003[SEP],[SEP]pps[SEP]in[SEP]mil[SEP].[SEP]€[SEP])	528
u[SEP].[SEP]s[SEP].[SEP]viewers[SEP]([SEP]million[SEP])	529
region[SEP]2	530
beginning	531
dvd[SEP]name	532
out	533
/	534
released	535
2005	536
2009	537
62	538
10th	539
reports	540
races	541
took	542
october[SEP]16	543
race[SEP]name	544
newman[SEP]/[SEP]haas[SEP]racing	545
city[SEP]/[SEP]location	546
rate	547
groups	548
between	549
areas	550
group	551
lap[SEP]-[SEP]by[SEP]-[SEP]lap	552
network	553
host	554
occur	555
airing	556
no[SEP].[SEP]in[SEP]series	557
63	558
got	559
viewership	560
26[SEP].[SEP]53	561
u[SEP].[SEP]s[SEP].[SEP]viewers[SEP]([SEP]millions[SEP])	562
tuned	563
into	564
show	565
94	566
113	567
23	568
originally	569
rounds	570
held	571
hold	572
#[SEP]of[SEP]bids	573
conference	574
round[SEP]of[SEP]32	575
larger	576
1[SEP].[SEP]0	577
completed	578
much	579
compete	580
challenge	581
directors	582
film[SEP]title[SEP]used[SEP]in[SEP]nomination	583
village[SEP]([SEP]slovenian[SEP])	584
names	585
percent[SEP]of[SEP]slovenes[SEP]1951	586
villages	587
percent[SEP]of[SEP]slovenes[SEP]1991	588
village[SEP]([SEP]german[SEP])	589
known	590
high[SEP]points	591
scoring	592
get	593
leader	594
he	595
de	596
cfl[SEP]team	597
winnipeg[SEP]blue[SEP]bombers	598
montreal[SEP]alouettes	599
toronto[SEP]argonauts	600
cb	601
new[SEP]mexico	602
ohio[SEP]state	603
ol	604
2006	605
saskatchewan[SEP]roughriders	606
earliest	607
table	608
latest	609
seasons	610
processor	611
models	612
frequencies	613
sport	614
average[SEP]attendance	615
leagues	616
2013	617
finale	618
hk[SEP]viewers	619
34	620
under	621
writer[SEP]([SEP]s[SEP])	622
codes	623
planet	624
radial[SEP]velocity[SEP]([SEP]m[SEP]/[SEP]s[SEP])	625
orbital[SEP]period	626
semimajor[SEP]axis[SEP]([SEP]au[SEP])	627
saskatchewan	628
shown	629
1997	630
broadcast	631
sum	632
id	633
assigned	634
managed	635
oklahoma	636
height	637
weighs	638
320	639
pounds	640
colleges	641
db	642
picks	643
calgary[SEP]stampeders	644
york	645
27	646
selected	647
selection	648
fb	649
lb	650
43	651
release[SEP]date	652
reference	653
japanese[SEP]title	654
romaji[SEP]title	655
singles	656
chart	657
partial[SEP]thromboplastin[SEP]time	658
conditions	659
unaffected	660
prothrombin[SEP]time	661
prolonged	662
bleeding[SEP]time	663
factor[SEP]xii[SEP]deficiency	664
platelet[SEP]count	665
tuesday	666
wednesday	667
monday	668
thursday	669
saturday	670
sunday	671
drove	672
winning[SEP]driver	673
drivers	674
original[SEP]name	675
districts	676
population[SEP]at[SEP]2010[SEP]census	677
current	678
area[SEP]in[SEP]km²	679
km2	680
interregnum[SEP]ended	681
series[SEP]#	682
36	683
38	684
manhattan	685
queens	686
richmond[SEP][staten[SEP]is[SEP].[SEP]]	687
brooklyn	688
%	689
central	690
2[SEP].[SEP]61	691
millions	692
viewed	693
2[SEP].[SEP]12	694
drew	695
3[SEP].[SEP]6	696
79	697
mls[SEP]cup[SEP]winner	698
mls[SEP]cup[SEP]runner[SEP]-[SEP]up	699
audition[SEP]city	700
its	701
episode[SEP]air[SEP]date	702
station	703
owned[SEP]since	704
channels	705
stations	706
affiliated	707
2002	708
city[SEP]of[SEP]license[SEP]/[SEP]market	709
engine	710
performance	711
turbo	712
trim	713
torque	714
transmission	715
power	716
english[SEP]title	717
33	718
peak	719
42	720
premiere	721
less	722
chinese[SEP]title	723
weekly[SEP]rank	724
air[SEP]date	725
18[SEP]–[SEP]49[SEP]([SEP]rating[SEP]/[SEP]share[SEP])	726
viewers[SEP]([SEP]m[SEP])	727
rating	728
5[SEP].[SEP]3	729
capacity	730
ayr[SEP]united	731
outgoing[SEP]manager	732
replacement	733
3[SEP]credits	734
180	735
hand	736
4[SEP]credits	737
5[SEP]credits	738
days	739
vacant	740
manner[SEP]of[SEP]departure	741
st[SEP].[SEP]johnstone	742
semi[SEP]-[SEP]finalist[SEP]#[SEP]2	743
na	744
2007	745
semi[SEP]-[SEP]finalist[SEP]#[SEP]1	746
north[SEP]carolina[SEP]state	747
numer[SEP]of[SEP]jamaicans[SEP]granted[SEP]british[SEP]citizenship	748
registration[SEP]of[SEP]a[SEP]minor[SEP]child	749
114	750
281	751
first[SEP]air[SEP]date	752
15	753
catalog[SEP]number	754
studio	755
losing	756
1993	757
compression[SEP]ratio	758
ration	759
power[SEP],[SEP]continuous	760
hp[SEP]([SEP]kw[SEP])[SEP]at[SEP]2[SEP],[SEP]200[SEP]rpm	761
critical[SEP]altitude[SEP]this[SEP]is[SEP]the[SEP]highest[SEP]altitude[SEP]at[SEP]which[SEP]the[SEP]engine[SEP]can[SEP]achieve[SEP]its[SEP]full[SEP]continuous[SEP]power[SEP]rating[SEP].[SEP]above[SEP]this[SEP]altitude[SEP],[SEP]power[SEP]falls[SEP]off[SEP]with[SEP]height[SEP]as[SEP]with[SEP]a[SEP]naturally[SEP]aspirated[SEP]engine[SEP].[SEP]see[SEP]supercharger[SEP]#[SEP]altitude[SEP]effects[SEP]for[SEP]details[SEP].	762
lost	763
belonged	764
6[SEP].[SEP]3	765
share	766
18[SEP]-[SEP]49[SEP]([SEP]rating[SEP]/[SEP]share[SEP])	767
first[SEP]appearance	768
experience	769
last[SEP]appearance	770
appearances	771
her	772
actors	773
top[SEP]division[SEP]titles	774
number[SEP]of[SEP]seasons[SEP]in[SEP]top[SEP]division	775
viewers[SEP]([SEP]millions[SEP])	776
rank[SEP]([SEP]week[SEP])	777
20	778
rank[SEP]([SEP]timeslot[SEP])	779
rank[SEP]([SEP]night[SEP])	780
having	781
carbon[SEP]dioxide[SEP]emissions[SEP]per[SEP]year[SEP]([SEP]10[SEP]6[SEP]tons[SEP])[SEP]([SEP]2006[SEP])	782
co2	783
carbon[SEP]dioxide[SEP]emissions[SEP]per[SEP]year[SEP]([SEP]tons[SEP]per[SEP]person[SEP])[SEP]([SEP]2007[SEP])	784
1[SEP].[SEP]4	785
russia	786
india	787
produced	788
rank[SEP]([SEP]#[SEP])	789
points[SEP]awarded[SEP]([SEP]platinum[SEP])	790
range	791
5th	792
70	793
ranked	794
85	795
timeslot	796
original	797
1[SEP].[SEP]82	798
seen	799
2[SEP].[SEP]05	800
extroverted[SEP],[SEP]relationship[SEP]-[SEP]oriented	801
batting[SEP]team	802
runs	803
durham	804
fielding[SEP]team	805
155	806
batting[SEP]partners	807
226	808
his	809
career	810
18[SEP].[SEP]73	811
shows	812
rank[SEP]([SEP]wjc[SEP])	813
metro[SEP]area	814
los[SEP]angeles	815
number[SEP]of[SEP]jews[SEP]([SEP]wjc[SEP])	816
rank[SEP]([SEP]arda[SEP])	817
number[SEP]of[SEP]jews[SEP]([SEP]asarb[SEP])	818
philadelphia	819
open[SEP]1[SEP]st[SEP]viii	820
u15[SEP]3rd[SEP]iv	821
bbc	822
gt	823
crew	824
850	825
stm	826
1990	827
monaco[SEP]grand[SEP]prix	828
grand[SEP]prix	829
french[SEP]grand[SEP]prix	830
numbers	831
constructed	832
ferrari	833
michael[SEP]schumacher	834
holding	835
list	836
canadian[SEP]grand[SEP]prix	837
rd[SEP].	838
result	839
2r	840
outcome	841
night[SEP]rank	842
overall[SEP]rank	843
rating[SEP]/[SEP]share[SEP]18[SEP]–[SEP]49	844
modena	845
winning[SEP]constructor	846
constructors	847
riccardo[SEP]patrese	848
german[SEP]grand[SEP]prix	849
portuguese[SEP]grand[SEP]prix	850
occurred	851
hockenheimring	852
silverstone	853
windows	854
other	855
0[SEP].[SEP]7[SEP]%	856
source	857
abbreviation	858
japanese[SEP]orthography	859
providers	860
1964	861
half[SEP]marathon[SEP]([SEP]womens[SEP])	862
represented	863
car	864
day	865
grand	866
prix	867
jerez	868
event	869
detroit	870
events	871
nigel[SEP]mansell	872
drive	873
season[SEP]result	874
7th	875
9th	876
grand[SEP]finalist	877
collingwood	878
margin	879
51	880
crowd	881
venue	882
south[SEP]melbourne	883
alain[SEP]prost	884
race[SEP]winner	885
constructor	886
rnd	887
essendon	888
1984	889
runner[SEP]up	890
hawthorn	891
geelong	892
ups	893
patrick[SEP]tambay	894
kyalami	895
john[SEP]watson	896
monza	897
argentine[SEP]grand[SEP]prix	898
italian[SEP]grand[SEP]prix	899
renault	900
james[SEP]hunt	901
laps	902
oulton[SEP]park	903
niki[SEP]lauda	904
jean[SEP]-[SEP]pierre[SEP]jarier	905
clay[SEP]regazzoni	906
te	907
dated	908
kind	909
different	910
juan[SEP]manuel[SEP]fangio	911
syracuse	912
take	913
us	914
join	915
13[SEP].[SEP]66	916
standing	917
liscumb	918
ben[SEP]-[SEP]tahir	919
296	920
tv	921
kickoff[SEP][a[SEP]]	922
houses	923
green	924
house[SEP]name	925
made	926
house	927
channel	928
minnesota[SEP]vikings	929
1[SEP]-[SEP]3	930
crowds	931
finished	932
hosted	933
ended	934
fourth[SEP]place	935
places	936
2003	937
engine[SEP]type	938
max[SEP].[SEP]torque[SEP]at[SEP]rpm	939
$	940
torque[SEP]([SEP]nm@rpm[SEP])	941
comment	942
model[SEP]name	943
engine[SEP]code	944
47	945
turkey	946
years[SEP]for[SEP]jazz	947
oregon	948
minnesota	949
iowa[SEP]state	950
wears	951
shooting[SEP]guard	952
jersey	953
maryland	954
54	955
2010[SEP]-[SEP]11	956
53	957
they	958
ve	959
1[SEP]st[SEP]ship[SEP]delivery[SEP]date	960
ship[SEP]types[SEP]delivered	961
ships	962
features	963
featuring	964
111	965
placed	966
4th[SEP]place	967
3rd[SEP]place	968
1[SEP]st[SEP]place	969
2001	970
runner[SEP]([SEP]s[SEP])[SEP]-[SEP]up	971
tiger	972
tournament	973
54[SEP]holes	974
margin[SEP]of[SEP]victory	975
over	976
68	977
cuts[SEP]made	978
locomotives	979
size	980
x	981
builder	982
wheel[SEP]arrangement	983
build	984
locomotive	985
number[SEP]of[SEP]goals	986
frequency	987
part[SEP]number[SEP]([SEP]s[SEP])	988
socket	989
sspec[SEP]number	990
michigan	991
purse[SEP]([SEP]$[SEP])	992
tournaments	993
locations	994
nickname	995
1918	996
arizona	997
state[SEP]&[SEP]federal	998
seat	999
holds	1000
population[SEP],[SEP]in[SEP]thousands[SEP],[SEP]([SEP]1905[SEP])	1001
area[SEP],[SEP]in[SEP]thousands[SEP]of[SEP]km[SEP]2	1002
figure	1003
football[SEP]park	1004
port[SEP]adelaide	1005
may[SEP]28	1006
1[SEP]st[SEP]prize[SEP]([SEP]$[SEP])	1007
money	1008
virginia	1009
minimal	1010
rhode[SEP]island	1011
series[SEP]no[SEP].	1012
airdate	1013
featured	1014
prize	1015
season[SEP]#	1016
61	1017
6[SEP]–[SEP]3[SEP],[SEP]6[SEP]–[SEP]2	1018
viewers	1019
write	1020
2008	1021
married[SEP]filing[SEP]separately	1022
head[SEP]of[SEP]household	1023
single	1024
married[SEP]filing[SEP]jointly[SEP]or[SEP]qualified[SEP]widow[SEP]([SEP]er[SEP])	1025
coach	1026
captain	1027
win[SEP]/[SEP]loss	1028
2005[SEP]-[SEP]06	1029
disaster	1030
peru	1031
no[SEP].[SEP]of[SEP]communes	1032
voivodenship	1033
big	1034
also	1035
lived	1036
capital	1037
leave	1038
1880	1039
gross[SEP]tonnage	1040
ship	1041
1923	1042
1913	1043
date[SEP]entered[SEP]service	1044
tonnage	1045
date[SEP]withdrawn	1046
appears	1047
18	1048
champions	1049
third[SEP]place	1050
hometowns	1051
catcher	1052
mlb[SEP]draft	1053
hometown	1054
goes	1055
pitcher	1056
town	1057
postion	1058
south[SEP]carolina	1059
belong	1060
stanford	1061
associated	1062
indianapolis[SEP],[SEP]indiana	1063
running[SEP]back	1064
nebraska	1065
nba[SEP]draft	1066
present	1067
home	1068
kentucky	1069
audience	1070
calculator	1071
year[SEP]released	1072
director[SEP]([SEP]s[SEP])	1073
2[SEP].[SEP]06	1074
school[SEP]/[SEP]club[SEP]team[SEP]/[SEP]country	1075
purdue	1076
height[SEP]in[SEP]ft[SEP].	1077
years[SEP]for[SEP]rockets	1078
6[SEP]-[SEP]0	1079
7[SEP]-[SEP]0	1080
tall	1081
;	1082
them	1083
6[SEP]-[SEP]6	1084
feet	1085
frame	1086
this	1087
hight	1088
tenure	1089
lasted	1090
guard[SEP]/[SEP]forward	1091
32	1092
55	1093
density[SEP]([SEP]/[SEP]km²[SEP])	1094
friday	1095
each	1096
clemson	1097
t20[SEP]matches	1098
fc[SEP]matches	1099
units	1100
wounded	1101
complement	1102
killed	1103
gdp[SEP]per[SEP]capita[SEP]([SEP]nominal[SEP])	1104
$[SEP]29[SEP].[SEP]9[SEP]billion	1105
gdp[SEP]([SEP]nominal[SEP])	1106
uzbekistan	1107
aspect[SEP]ratio	1108
num[SEP]of[SEP]discs	1109
releases	1110
run	1111
forward	1112
club[SEP]team	1113
126	1114
78	1115
mississippi	1116
norwegian[SEP]americans[SEP]([SEP]2000[SEP])	1117
version	1118
track	1119
tracks	1120
track[SEP]time	1121
gt2[SEP]winning[SEP]team	1122
esp	1123
p	1124
mf	1125
first[SEP]day[SEP]cover[SEP]cancellation	1126
themed	1127
stamp	1128
responsible	1129
design	1130
theme	1131
paper[SEP]type	1132
created	1133
nicknames	1134
meaning	1135
means	1136
high[SEP]assists	1137
49	1138
high[SEP]rebounds	1139
station[SEP]number	1140
issue[SEP]price[SEP]([SEP]proof[SEP])	1141
25[SEP],[SEP]000	1142
artist	1143
first[SEP]class[SEP]team	1144
bowling[SEP]style	1145
batting[SEP]style	1146
musical[SEP]guest[SEP]and[SEP]song	1147
guests	1148
location[SEP]attendance	1149
november[SEP]24	1150
november[SEP]4	1151
final	1152
march[SEP]26	1153
us[SEP]airways[SEP]center[SEP]18[SEP],[SEP]422	1154
april[SEP]25	1155
january[SEP]23	1156
san[SEP]antonio	1157
rebound	1158
november[SEP]15	1159
67	1160
playing	1161
december[SEP]12	1162
57	1163
@[SEP]milwaukee	1164
24	1165
december[SEP]8	1166
gave	1167
april[SEP]20	1168
may[SEP]11	1169
scorer	1170
count	1171
march[SEP]17	1172
assist	1173
streak	1174
leading[SEP]scorer	1175
26	1176
december[SEP]2	1177
february[SEP]21	1178
march[SEP]27	1179
visitor	1180
phoenix[SEP]suns	1181
april[SEP]29	1182
preliminaries	1183
evening[SEP]gown	1184
interview	1185
swimsuit	1186
seated	1187
playoff	1188
reg[SEP].[SEP]season	1189
4th	1190
regular	1191
open[SEP]cup	1192
cups	1193
finish	1194
1992	1195
status	1196
joe[SEP]gibbs[SEP]racing	1197
author[SEP]/[SEP]editor[SEP]/[SEP]source	1198
index[SEP]([SEP]year[SEP])	1199
countries[SEP]sampled	1200
ranking[SEP]l[SEP].[SEP]a[SEP].[SEP]([SEP]2[SEP])	1201
world[SEP]ranking[SEP]([SEP]1[SEP])	1202
1989	1203
womens[SEP]doubles	1204
womens[SEP]singles	1205
mixed[SEP]doubles	1206
mens[SEP]singles	1207
story	1208
authored	1209
pinyin	1210
simplified	1211
area	1212
nhl[SEP]team[SEP]([SEP]s[SEP])	1213
metropolitan[SEP]area	1214
nuggets	1215
vendor[SEP]and[SEP]type	1216
comments	1217
percent[SEP]for	1218
max	1219
manitoba	1220
trains	1221
often	1222
train[SEP]name	1223
end	1224
academic[SEP]&[SEP]university[SEP]affairs	1225
human[SEP]resources[SEP]&[SEP]operations	1226
data	1227
information	1228
model[SEP]/[SEP]engine	1229
torque[SEP]([SEP]nm[SEP])[SEP]/[SEP]rpm	1230
n·m[SEP]([SEP]lb·ft[SEP])[SEP]/[SEP]*n·m[SEP]([SEP]lb·ft[SEP])[SEP]@1750	1231
power[SEP]/[SEP]rpm	1232
end[SEP]of[SEP]term	1233
president	1234
date[SEP]of[SEP]inauguration	1235
winning[SEP]pitcher	1236
june[SEP]25	1237
may[SEP]20	1238
losing[SEP]pitcher	1239
new[SEP]york[SEP]rangers	1240
chicago[SEP]black[SEP]hawks	1241
buffalo[SEP]sabres	1242
canada	1243
philadelphia[SEP]flyers	1244
89	1245
minnesota[SEP]north[SEP]stars	1246
detroit[SEP]red[SEP]wings	1247
goaltender	1248
includes	1249
7th[SEP],[SEP]southeast	1250
see	1251
norway	1252
winner[SEP]women	1253
third	1254
italy	1255
finland	1256
sweden	1257
jenson[SEP]button	1258
third[SEP]year	1259
course	1260
class	1261
following	1262
classes	1263
taken	1264
first[SEP]year	1265
program	1266
mens[SEP]doubles	1267
.[SEP]308[SEP]winchester[SEP]cartridge[SEP]type	1268
types	1269
300[SEP]m[SEP]group[SEP]([SEP]moa[SEP])	1270
0[SEP].[SEP]63	1271
45	1272
cincinnati[SEP]bengals	1273
available	1274
chapter	1275
motogp[SEP]winner	1276
125cc[SEP]winner	1277
fought	1278
call	1279
calling[SEP]at	1280
1[SEP]usd[SEP]=	1281
1[SEP]euro[SEP]=	1282
local	1283
currency	1284
equals	1285
14	1286
28	1287
136	1288
competed	1289
note	1290
ship[SEP]name	1291
young[SEP]rider[SEP]classification	1292
stage	1293
leading	1294
general[SEP]classification	1295
intergiro[SEP]classification	1296
trofeo[SEP]fast[SEP]team	1297
16	1298
cause	1299
live[SEP]births[SEP]2006	1300
tfr[SEP]2006	1301
gfr[SEP]2006	1302
whites[SEP]as[SEP]%[SEP]of[SEP]pop[SEP].	1303
isolation[SEP]([SEP]km[SEP])	1304
elevation[SEP]([SEP]m[SEP])	1305
municipality	1306
double	1307
promoted	1308
reverse	1309
swimming	1310
alloy	1311
denomination	1312
football	1313
nigeria	1314
1999	1315
fastest[SEP]time[SEP]([SEP]s[SEP])	1316
runners[SEP]-[SEP]up	1317
nation	1318
malaysia	1319
vietnam	1320
voted	1321
eliminated	1322
goals	1323
athlete	1324
mexico[SEP]city	1325
broadcast[SEP]order	1326
number[SEP]in[SEP]series	1327
u[SEP].[SEP]s[SEP].[SEP]air[SEP]date	1328
serves	1329
cost[SEP]per[SEP]capita	1330
new[SEP]york	1331
preliminary	1332
contestant	1333
achieve	1334
belongs	1335
nevada	1336
competition	1337
date[SEP]and[SEP]time	1338
competitions	1339
power[SEP]([SEP]kw[SEP])	1340
relay	1341
5kw	1342
shooting	1343
riding	1344
total[SEP]viewers[SEP]([SEP]in[SEP]millions[SEP])	1345
english[SEP]spelling	1346
hebrew[SEP]word	1347
word	1348
contains	1349
i	1350
listing	1351
divisions	1352
1981	1353
local[SEP]name	1354
length	1355
year[SEP]opened	1356
1995	1357
1950	1358
340	1359
668	1360
overall[SEP]record	1361
club	1362
dallas[SEP]burn	1363
goals[SEP]for	1364
prize[SEP]money	1365
losing[SEP]hand	1366
population[SEP]august[SEP]15[SEP],[SEP]2012	1367
307	1368
sector	1369
1947	1370
total[SEP]region	1371
304	1372
1882	1373
kansas	1374
goals[SEP]against[SEP]avg[SEP].	1375
dallas	1376
d	1377
c	1378
united	1379
column	1380
goals[SEP]against	1381
date[SEP]([SEP]from[SEP])	1382
date[SEP]([SEP]to[SEP])	1383
1919	1384
form	1385
fitzroy	1386
population[SEP]([SEP]glengallan[SEP])	1387
figures	1388
given	1389
population[SEP]([SEP]region[SEP]total[SEP])	1390
population[SEP]([SEP]stanthorpe[SEP])	1391
population[SEP]([SEP]rosenthal[SEP])	1392
launched	1393
namesake	1394
laid[SEP]down	1395
teaching[SEP]language	1396
duration[SEP]([SEP]years[SEP])	1397
1[SEP].[SEP]5	1398
3[SEP].[SEP]5	1399
song[SEP]title	1400
biggest	1401
owner[SEP]([SEP]s[SEP])	1402
driver[SEP]([SEP]s[SEP])	1403
primary[SEP]sponsor[SEP]([SEP]s[SEP])	1404
crew[SEP]chief	1405
chiefs	1406
start	1407
loan[SEP]club	1408
republican	1409
committee	1410
democratic	1411
first[SEP]win	1412
pos	1413
molecular[SEP]target	1414
compound[SEP]name	1415
chemical[SEP]class	1416
clock[SEP]speed	1417
costs	1418
thursday[SEP]iuppiter[SEP]([SEP]jupiter[SEP])	1419
tuesday[SEP]mars[SEP]([SEP]mars[SEP])	1420
friday[SEP]venus[SEP]([SEP]venus[SEP])	1421
saturday[SEP]saturnus[SEP]([SEP]saturn[SEP])	1422
dance	1423
jive	1424
week[SEP]#	1425
say	1426
polish	1427
system	1428
language	1429
thursday[SEP]day[SEP]five	1430
friday[SEP]day[SEP]six	1431
april[SEP]13	1432
loses	1433
points[SEP]against	1434
draws	1435
30	1436
tries[SEP]against	1437
try[SEP]bonus	1438
64	1439
tries[SEP]for	1440
entry	1441
row	1442
8th	1443
450	1444
drawn	1445
46	1446
points[SEP]for	1447
losing[SEP]bonus	1448
60	1449
agains	1450
389	1451
tied	1452
76	1453
earnings[SEP]([SEP]€[SEP])	1454
19	1455
listings	1456
wher	1457
barrel[SEP]length	1458
lengths	1459
city[SEP]/[SEP]town	1460
provided	1461
1966	1462
barrel[SEP]twist	1463
barrel[SEP]profile	1464
a1	1465
a2	1466
inches	1467
muzzle[SEP]device	1468
colt[SEP]model[SEP]no[SEP].	1469
guard	1470
41	1471
background	1472
clubs	1473
constituency	1474
for[SEP]([SEP]%[SEP])	1475
percentages	1476
original[SEP]airdate	1477
watch	1478
episode[SEP]5	1479
no	1480
current[SEP]club	1481
panathinaikos	1482
center	1483
year[SEP]born	1484
real[SEP]madrid	1485
2[SEP].[SEP]09	1486
2[SEP].[SEP]02	1487
m	1488
wear	1489
1980	1490
viewers[SEP]([SEP]in[SEP]millions[SEP])	1491
construction[SEP]start	1492
unit	1493
values	1494
started	1495
commercial[SEP]operation	1496
since	1497
total[SEP]viewers	1498
episode[SEP]number	1499
series[SEP]number	1500
washington[SEP],[SEP]d[SEP].[SEP]c[SEP].	1501
new[SEP]jersey	1502
delaware	1503
pennsylvania	1504
head[SEP]coach	1505
new[SEP]hampshire	1506
losses	1507
winning[SEP]score	1508
1987	1509
174	1510
kerry[SEP]#	1511
bush[SEP]#	1512
others[SEP]#	1513
the[SEP]mole	1514
vote	1515
bush	1516
candidates	1517
steals	1518
rebounds	1519
blocks	1520
silver[SEP]medals	1521
gold[SEP]medals	1522
total[SEP]medals	1523
gt3[SEP]winner	1524
coins	1525
diameter	1526
coin	1527
lithuania	1528
gdp[SEP]([SEP]billion[SEP]us[SEP]$[SEP])	1529
gdp[SEP]per[SEP]capita[SEP]([SEP]us[SEP]$[SEP])	1530
austria	1531
rookie[SEP]of[SEP]the[SEP]year	1532
qualifying[SEP]score	1533
qualifying[SEP]rank	1534
season[SEP]finale[SEP]date	1535
recent	1536
release	1537
april[SEP]8	1538
yards	1539
seahawks	1540
san[SEP]diego[SEP]chargers	1541
kansas[SEP]city[SEP]chiefs	1542
resulted	1543
2[SEP]-[SEP]2	1544
0[SEP]-[SEP]1	1545
1[SEP]-[SEP]1	1546
kingdome	1547
mile[SEP]high[SEP]stadium	1548
los[SEP]angeles[SEP]rams	1549
185	1550
weight	1551
95	1552
phil[SEP]mickelson	1553
resulting	1554
lose	1555
qf	1556
happening	1557
chile	1558
s[SEP]mestizo	1559
asians	1560
native[SEP]american	1561
david[SEP]duchovny	1562
22	1563
address	1564
building	1565
the[SEP]complete[SEP]fifth[SEP]series	1566
complete[SEP]series	1567
the[SEP]complete[SEP]seventh[SEP]series	1568
region[SEP]4	1569
region[SEP]1	1570
tba	1571
tries	1572
52	1573
air	1574
prod[SEP].[SEP]code	1575
incumbent	1576
someone	1577
first[SEP]elected	1578
massachusetts[SEP]3	1579
ran	1580
1994	1581
re[SEP]-[SEP]elected	1582
south[SEP]carolina[SEP]3	1583
south[SEP]carolina[SEP]4	1584
parties	1585
elections	1586
candidate	1587
office	1588
incumbents	1589
1969	1590
represent	1591
1974	1592
washington[SEP]7	1593
dbeingtrict	1594
1982	1595
elected	1596
1958	1597
1952	1598
would	1599
1976	1600
1960	1601
serve	1602
sitting	1603
involving	1604
again	1605
outcomes	1606
feature	1607
louisiana[SEP]5	1608
politician	1609
voting	1610
recently	1611
1940	1612
1954	1613
section	1614
carl[SEP]vinson	1615
1961	1616
political	1617
affiliation	1618
1942	1619
arkansas[SEP]2	1620
james	1621
1936	1622
official	1623
1914	1624
1956	1625
1944	1626
1938	1627
1932	1628
1941	1629
1920	1630
those	1631
1946	1632
wehre	1633
1948	1634
1943	1635
polling	1636
involved	1637
representatives	1638
1939	1639
fourth	1640
arkansas	1641
william[SEP]j[SEP].[SEP]driver	1642
1922	1643
1927	1644
1916	1645
panthers	1646
mascot	1647
eagles	1648
net	1649
gain	1650
california	1651
height[SEP]([SEP]ft[SEP])	1652
call[SEP]sign	1653
target[SEP]city[SEP]/[SEP]market	1654
owns	1655
city[SEP]of[SEP]license	1656
3rd	1657
rankings	1658
per[SEP]capita[SEP]income	1659
number[SEP]of[SEP]households	1660
old	1661
horse	1662
work	1663
radio[SEP]electrical	1664
=	1665
episode[SEP]title	1666
brand	1667
along	1668
scott[SEP]dixon	1669
graham[SEP]rahal	1670
most[SEP]laps[SEP]led	1671
speed	1672
channel[SEP]tv[SEP]([SEP]dt[SEP])	1673
boston	1674
current[SEP]status	1675
entries	1676
fox	1677
1986	1678
180s	1679
sets[SEP]won	1680
140[SEP]+	1681
new[SEP]channel[SEP]([SEP]s[SEP])	1682
coming	1683
back	1684
danced	1685
more	1686
mean	1687
number[SEP]of[SEP]dances	1688
gender	1689
senior[SEP]high[SEP]school[SEP]([SEP]15[SEP]–[SEP]18[SEP]yrs[SEP])	1690
specification	1691
male	1692
1[SEP]-[SEP]2	1693
charlotte	1694
scorers	1695
utah	1696
march[SEP]7	1697
72	1698
vancouver	1699
pairs	1700
april[SEP]12	1701
92	1702
325	1703
total[SEP]electricity[SEP]demand	1704
%[SEP]renewable[SEP]of[SEP]total[SEP]electricity[SEP]demand	1705
numbered	1706
distance	1707
winner[SEP]/[SEP]2nd	1708
6th	1709
weight[SEP]([SEP]kg[SEP])	1710
raced	1711
dbeingtribution	1712
yes	1713
unknown	1714
2012[SEP]commission	1715
jockey	1716
international	1717
sales	1718
farm	1719
production	1720
6[SEP].[SEP]9	1721
level	1722
low	1723
san[SEP]juan	1724
january[SEP]3	1725
april[SEP]1	1726
led	1727
66	1728
1[SEP]-[SEP]4	1729
point	1730
opposing	1731
seattle	1732
portland	1733
1985[SEP]-[SEP]1990	1734
1995[SEP]-[SEP]2000	1735
2000[SEP]-[SEP]2005	1736
2[SEP].[SEP]52	1737
1990[SEP]-[SEP]1995	1738
total[SEP]population	1739
title[SEP]and[SEP]source	1740
to[SEP]winning[SEP]team	1741
149	1742
2400[SEP]kwh[SEP]/[SEP]kwp•y	1743
11[SEP].[SEP]8	1744
1[SEP].[SEP]1	1745
spokesperson	1746
france	1747
year[SEP]([SEP]s[SEP])	1748
may[SEP]21	1749
w[SEP]-[SEP]l[SEP]-[SEP]d	1750
games[SEP]played	1751
uses	1752
date[SEP]announced	1753
asset[SEP]acquired	1754
acquired	1755
date[SEP]completed	1756
546	1757
77	1758
percentage[SEP]of[SEP]votes	1759
number[SEP]of[SEP]deputies	1760
112	1761
election[SEP]date	1762
story[SEP]by	1763
high[SEP]school	1764
nicknamed	1765
delta[SEP]center	1766
heat	1767
november[SEP]25	1768
6[SEP]-[SEP]3	1769
country[SEP]/[SEP]region	1770
seasons[SEP]and[SEP]winners	1771
local[SEP]title	1772
television[SEP]network	1773
judges	1774
presenters	1775
chroma[SEP]format	1776
artbeingt	1777
highest[SEP]position	1778
international[SEP]passengers	1779
transit[SEP]passengers	1780
airport	1781
freight[SEP]([SEP]metric[SEP]tonnes[SEP])	1782
percent	1783
total[SEP]passengers[SEP]2008	1784
change[SEP]2008[SEP]/[SEP]09	1785
6[SEP].[SEP]5[SEP]%	1786
liverpool	1787
total[SEP]passengers	1788
1978	1789
sq	1790
mi	1791
island	1792
population[SEP]([SEP]2000[SEP])	1793
ceremony	1794
pride	1795
awards	1796
vineyard[SEP]surface[SEP]([SEP]2010[SEP])	1797
grand[SEP]cru	1798
village	1799
wine[SEP]style	1800
red[SEP]wine	1801
hectares[SEP]([SEP]acres[SEP])	1802
frequency[SEP]mhz	1803
fcc[SEP]info	1804
condition	1805
decreased[SEP]or[SEP]unaffected	1806
decreased	1807
delegate	1808
counties[SEP]represented	1809
representing	1810
arena[SEP]([SEP]capacity[SEP])	1811
race[SEP]title	1812
hidden[SEP]valley[SEP]raceway	1813
queensland[SEP]raceway	1814
green[SEP]bay[SEP]packers	1815
counties	1816
area[SEP]([SEP]km[SEP]2[SEP])	1817
population[SEP]census[SEP]2009	1818
code	1819
chassis	1820
1979	1821
vehicle	1822
virtual[SEP]channel	1823
9[SEP].[SEP]1	1824
digital[SEP]channel	1825
st	1826
own	1827
350	1828
177	1829
84	1830
telugu[SEP]తెలుగు	1831
75	1832
extra	1833
48	1834
buenos[SEP]aires	1835
measurement	1836
voice[SEP]actor[SEP]([SEP]english[SEP]1998[SEP]/[SEP]pioneer[SEP])	1837
englbeingh	1838
voice[SEP]actor[SEP]([SEP]english[SEP]1997[SEP]/[SEP]saban[SEP])	1839
character[SEP]name	1840
large	1841
mission	1842
primary[SEP]payload[SEP]([SEP]s[SEP])	1843
launch[SEP]date	1844
columbia	1845
pts	1846
nc	1847
motorcycle	1848
aprilia	1849
250cc	1850
81	1851
defensive	1852
february	1853
offensive	1854
3a	1855
established	1856
1973	1857
students	1858
pupil[SEP]/[SEP]teacher[SEP]ratio	1859
edition	1860
congress	1861
lowest[SEP]point	1862
gulf[SEP]of[SEP]mexico	1863
texas	1864
highest[SEP]point	1865
genre	1866
1990s	1867
home[SEP]([SEP]1[SEP]st[SEP]leg[SEP])	1868
aggregate	1869
2[SEP]-[SEP]0	1870
1[SEP]st[SEP]leg	1871
home[SEP]([SEP]2nd[SEP]leg[SEP])	1872
belgrano	1873
2nd[SEP]leg	1874
2[SEP]-[SEP]4	1875
2nd[SEP]round	1876
standings	1877
conference[SEP]semifinals	1878
did[SEP]not[SEP]qualify	1879
16[SEP].[SEP]5	1880
fleet[SEP]numbers	1881
designation	1882
clock[SEP]rate[SEP]([SEP]mhz[SEP])	1883
principal[SEP]([SEP]2013[SEP]-[SEP]2014[SEP])	1884
assistant[SEP]principal[SEP]([SEP]2013[SEP]-[SEP]2014[SEP])	1885
served	1886
%[SEP]change	1887
8[SEP].[SEP]8	1888
8[SEP].[SEP]4	1889
population[SEP]rank	1890
exactly	1891
begin	1892
began	1893
run[SEP]time	1894
8[SEP].[SEP]2	1895
1900	1896
country[SEP]/[SEP]territory	1897
new[SEP]zealand	1898
spain	1899
away[SEP]team	1900
carlton	1901
home[SEP]team	1902
th	1903
ground	1904
away[SEP]team[SEP]score	1905
6[SEP].[SEP]9[SEP]([SEP]45[SEP])	1906
totals	1907
north[SEP]melbourne	1908
everyone	1909
extra[SEP]points	1910
field[SEP]goals	1911
extra[SEP]points[SEP]1[SEP]point	1912
field[SEP]goals[SEP]([SEP]5[SEP]points[SEP])	1913
total[SEP]points	1914
e	1915
clark	1916
uk[SEP]co[SEP]-[SEP]presenter	1917
comedian	1918
main[SEP]presenter	1919
enter	1920
finisher	1921
exited	1922
celebrity	1923
1992[SEP]-[SEP]93	1924
37	1925
1991[SEP]-[SEP]92	1926
91	1927
birth[SEP]date	1928
shirt[SEP]no	1929
1989[SEP]-[SEP]90	1930
river[SEP]plate	1931
3[SEP].[SEP]2	1932
44	1933
40	1934
economic[SEP]class	1935
1[SEP]st[SEP]([SEP]m[SEP])	1936
2nd[SEP]([SEP]m[SEP])	1937
overall[SEP]wc[SEP]points[SEP]([SEP]rank[SEP])	1938
122[SEP].[SEP]5	1939
episode[SEP]no[SEP].	1940
fin	1941
competitor	1942
full	1943
meters	1944
shea[SEP]stadium	1945
home[SEP]team[SEP]score	1946
attendees	1947
rich[SEP]stadium	1948
87	1949
1987[SEP]-[SEP]88	1950
88	1951
1988[SEP]-[SEP]89	1952
san[SEP]lorenzo	1953
telephone[SEP]([SEP]052[SEP])	1954
population[SEP]([SEP]people[SEP])	1955
name[SEP]of[SEP]administrative[SEP]unit	1956
t	1957
argentinos[SEP]juniors	1958
1986[SEP]-[SEP]87	1959
tour	1960
top[SEP]prize	1961
hosts	1962
milan	1963
ireland	1964
date[SEP]of[SEP]situation	1965
total[SEP]wins	1966
1896[SEP]no[SEP]game	1967
1894[SEP]wsu[SEP]10[SEP]–[SEP]0[SEP]moscow	1968
1899[SEP]wsu*[SEP]11[SEP]–[SEP]0[SEP]pullman	1969
o	1970
coached	1971
females[SEP]([SEP]%[SEP])	1972
class[SEP]aaaa	1973
2006[SEP]-[SEP]07	1974
2002[SEP]-[SEP]03	1975
2008[SEP]-[SEP]09	1976
canadian	1977
fall	1978
29[SEP]-[SEP]7	1979
far	1980
postseason	1981
rams	1982
weights	1983
branding	1984
nbc	1985
book	1986
august[SEP]10	1987
september[SEP]7	1988
social[SEP]democratic	1989
correspond	1990
left[SEP]bloc	1991
8[SEP].[SEP]9[SEP]%	1992
green[SEP]-[SEP]communist	1993
block	1994
socialist	1995
florida[SEP]state	1996
tight[SEP]end	1997
western[SEP]kentucky	1998
picked	1999
wide[SEP]receiver	2000
arizona[SEP]state	2001
penn[SEP]state	2002
usc	2003
denver[SEP]broncos	2004
oppenent	2005
detroit[SEP]lions	2006
details	2007
tampa[SEP]bay[SEP]buccaneers	2008
obamacare:[SEP]fed[SEP]/[SEP]state[SEP]/[SEP]partnership	2009
louisiana	2010
revenue[SEP]([SEP]millions[SEP])	2011
presidential[SEP]majority[SEP]2000[SEP]/[SEP]2004	2012
arrival	2013
station[SEP]code	2014
volume	2015
2004[SEP]–[SEP]05	2016
2011[SEP]–[SEP]12	2017
2008[SEP]–[SEP]09	2018
402	2019
mountain	2020
points[SEP]classification	2021
classifications	2022
awarded	2023
ride	2024
direct	2025
jack	2026
right[SEP]wing	2027
132	2028
vancouver[SEP]canucks	2029
borough	2030
hte	2031
tunisia	2032
international[SEP]tourist[SEP]arrivals[SEP]([SEP]2010[SEP])	2033
change[SEP]([SEP]2010[SEP]to[SEP]2011[SEP])	2034
international[SEP]tourist[SEP]arrivals[SEP]([SEP]2011[SEP])	2035
change[SEP]([SEP]2011[SEP]to[SEP]2012[SEP])	2036
international[SEP]tourist[SEP]arrivals[SEP]([SEP]2012[SEP])	2037
united[SEP]kingdom	2038
arranger	2039
female	2040
females[SEP]rank	2041
pilot	2042
human[SEP]development[SEP]index[SEP]([SEP]2000[SEP])	2043
population[SEP]([SEP]2005[SEP])	2044
population[SEP]density[SEP]([SEP]/[SEP]km[SEP]2[SEP])	2045
she	2046
3[SEP]-[SEP]dart[SEP]average	2047
t4	2048
earnings[SEP]([SEP]$[SEP])	2049
t2	2050
56	2051
2[SEP]credits	2052
1[SEP]credit	2053
200	2054
team[SEP]classification	2055
region[SEP]1[SEP]([SEP]us[SEP])	2056
put	2057
altitude[SEP]([SEP]km[SEP])	2058
conceded	2059
loss	2060
first[SEP]downs	2061
buffalo[SEP]bills	2062
yacht	2063
elapsed[SEP]time[SEP]d:hh:mm:ss	2064
yacht[SEP]type	2065
sail[SEP]number	2066
race[SEP]number	2067
loa[SEP]([SEP]metres[SEP])	2068
229	2069
entitled	2070
considered	2071
may	2072
no[SEP]competition	2073
performer[SEP]2	2074
performer[SEP]3	2075
performer[SEP]4	2076
stuart	2077
%[SEP]of[SEP]votes	2078
seats[SEP]won	2079
1[SEP].[SEP]69	2080
new[SEP]york[SEP]jets	2081
bhofen[SEP]#[SEP]1[SEP]([SEP]rk[SEP])	2082
bhofen[SEP]#[SEP]2[SEP]([SEP]rk[SEP])	2083
dallas[SEP]cowboys	2084
europe	2085
league[SEP]cup	2086
fa[SEP]cup	2087
142	2088
139	2089
gdp[SEP]millions[SEP]of[SEP]usd[SEP]([SEP]2009[SEP])	2090
indonesia	2091
hong[SEP]kong	2092
98	2093
chicago[SEP]bears	2094
western	2095
lacrosse	2096
new[SEP]conference	2097
team[SEP]nickname	2098
jockeys	2099
venues	2100
participant	2101
san[SEP]francisco[SEP]49ers	2102
0[SEP]–[SEP]1	2103
population[SEP]([SEP]2010[SEP]census[SEP])	2104
population[SEP]2000[SEP]census	2105
population[SEP]density[SEP]2010[SEP]([SEP]/[SEP]km²[SEP])	2106
administrative[SEP]division	2107
1996	2108
viewing[SEP]figure	2109
puerto[SEP]rico	2110
2nd[SEP]runner[SEP]-[SEP]up	2111
software	2112
license	2113
english	2114
french	2115
spanish	2116
german	2117
russian	2118
italian	2119
words	2120
fall[SEP]06	2121
man	2122
fall[SEP]05	2123
fall[SEP]09	2124
fall[SEP]07	2125
north[SEP]carolina	2126
colorado	2127
60[SEP].[SEP]6[SEP]%	2128
pf	2129
ends[SEP]lost	2130
shot[SEP]pct[SEP].	2131
blank[SEP]ends	2132
locale	2133
l	2134
stolen[SEP]ends	2135
combination[SEP]classification	2136
alessandro[SEP]petacchi	2137
alejandro[SEP]valverde	2138
mountains[SEP]classification	2139
18[SEP].[SEP]4	2140
team[SEP]([SEP]s[SEP])	2141
to[SEP]par	2142
framed[SEP]size	2143
categories	2144
attribute	2145
stages	2146
position[SEP]in[SEP]2012[SEP]–[SEP]13	2147
byron[SEP]nelson	2148
us[SEP]open	2149
stage[SEP]winner	2150
japan	2151
suhardi[SEP]hassan	2152
malaysian[SEP]rider[SEP]classification	2153
nominees	2154
nominee	2155
vote[SEP]to[SEP]evict	2156
eviction[SEP]no[SEP].	2157
vote[SEP]to[SEP]save	2158
series[SEP]ep[SEP].	2159
segment[SEP]c	2160
segment[SEP]d	2161
segment[SEP]b	2162
segment[SEP]a	2163
netflix	2164
167	2165
162	2166
whats	2167
242	2168
bowl[SEP]game	2169
bowl	2170
derby[SEP]county	2171
115	2172
engines	2173
details[SEP]of[SEP]journey	2174
uk[SEP]broadcast[SEP]date	2175
countries[SEP]visited	2176
usa	2177
labour	2178
social[SEP]and[SEP]liberal[SEP]democrats[SEP]/[SEP]liberal[SEP]democrats	2179
%[SEP]of[SEP]chinas[SEP]tujia[SEP]population	2180
tujia[SEP]population	2181
provinces	2182
group[SEP]a	2183
indiana	2184
group[SEP]c	2185
wisconsin	2186
iowa	2187
old[SEP]bulgarian[SEP]name[SEP]-[SEP]meaning	2188
indianapolis	2189
250cc[SEP]winner	2190
velocity[SEP]angle[SEP]η[SEP]in[SEP]i[SEP]-[SEP]radians	2191
condition[SEP]/[SEP]parameter	2192
coordinate[SEP]velocity[SEP]v[SEP]dx[SEP]/[SEP]dt[SEP]in[SEP]units[SEP]of[SEP]c	2193
proper[SEP]velocity[SEP]w[SEP]dx[SEP]/[SEP]dτ[SEP]in[SEP]units[SEP]of[SEP]c	2194
lorentz[SEP]factor[SEP]γ[SEP]dt[SEP]/[SEP]dτ[SEP]=[SEP]e[SEP]/[SEP]mc[SEP]2	2195
tournament[SEP]location	2196
winners[SEP]share[SEP]([SEP]$[SEP])	2197
northeast	2198
prizes	2199
palmeiras	2200
difference	2201
corinthians	2202
r[SEP]z[SEP]([SEP]arcsecond[SEP])	2203
muslim[SEP]([SEP]%[SEP]of[SEP]total[SEP]population[SEP])	2204
muslims	2205
pa	2206
w	2207
ends[SEP]won	2208
alabama	2209
category	2210
no[SEP].[SEP]2	2211
round[SEP]3	2212
round[SEP]5	2213
round[SEP]6[SEP]+	2214
goal	2215
ypiranga[SEP]-[SEP]sp	2216
279	2217
carvill	2218
hurricane	2219
index	2220
per	2221
hour	2222
r[SEP]([SEP]miles[SEP])	2223
9[SEP].[SEP]9	2224
animal	2225
accession[SEP]number	2226
genus[SEP]/[SEP]species	2227
common[SEP]name	2228
company	2229
based	2230
sg	2231
fifth[SEP]district	2232
fourth[SEP]district	2233
acquisition[SEP]via	2234
washington	2235
points[SEP]difference	2236
cars	2237
race[SEP]2	2238
race[SEP]3	2239
race[SEP]1	2240
reported	2241
jonathan[SEP]bomarito	2242
airs	2243
2:00pm	2244
08:00[SEP]pm	2245
3[SEP]([SEP]26[SEP])	2246
currently	2247
percentage[SEP]of[SEP]land[SEP]area	2248
ecozone	2249
percentage[SEP]of[SEP]total[SEP]area	2250
counts	2251
ring[SEP]name	2252
wrestlers	2253
born	2254
debut	2255
debuted	2256
proto[SEP]-[SEP]malayo[SEP]-[SEP]polynesian	2257
proto[SEP]-[SEP]austronesian	2258
father	2259
proto[SEP]-[SEP]oceanic	2260
mass[SEP]([SEP]kg[SEP])	2261
143	2262
weighing	2263
207	2264
102	2265
award[SEP]name	2266
weigh	2267
position[SEP]in[SEP]2013	2268
first[SEP]season	2269
2014	2270
number[SEP]of[SEP]seasons[SEP]in[SEP]second[SEP]tier	2271
october[SEP]11	2272
november[SEP]7	2273
november[SEP]14	2274
new[SEP]york[SEP]giants	2275
railway	2276
years[SEP]in[SEP]orlando	2277
date[SEP]of[SEP]issue	2278
atlanta[SEP],[SEP]ga	2279
interview[SEP]subject	2280
issue	2281
pictorials	2282
centerfold[SEP]model	2283
cover[SEP]model	2284
20[SEP]questions	2285
subject	2286
1600[SEP]kwh[SEP]/[SEP]kw[SEP]p[SEP]y	2287
1800[SEP]kwh[SEP]/[SEP]kw[SEP]p[SEP]y	2288
2400[SEP]kwh[SEP]/[SEP]kw[SEP]p[SEP]y	2289
5[SEP].[SEP]8	2290
arabic[SEP]capital[SEP]name	2291
4[SEP].[SEP]4	2292
rating[SEP]/[SEP]share[SEP]([SEP]18[SEP]-[SEP]49[SEP])	2293
58	2294
service[SEP]pattern	2295
platforms	2296
southern	2297
destination	2298
frequency[SEP]([SEP]per[SEP]hour[SEP])	2299
lines	2300
qualifying	2301
3[SEP]strokes	2302
runs[SEP]conceded	2303
wickets	2304
maidens	2305
sacramento	2306
59	2307
poll[SEP]winner	2308
isthe	2309
broadcasted	2310
original[SEP]artist	2311
order[SEP]#	2312
the[SEP]beatles	2313
series[SEP]premiere	2314
alberta	2315
success[SEP]rate	2316
livery	2317
locomotive[SEP]type	2318
control	2319
tv[SEP]broadcast	2320
january[SEP]9	2321
japanese	2322
chicago	2323
new[SEP]orleans	2324
february[SEP]18	2325
february[SEP]24	2326
residence	2327
content	2328
television[SEP]service	2329
package[SEP]/[SEP]option	2330
options	2331
hdtv	2332
sky[SEP]famiglia	2333
dar	2334
16:9	2335
offers	2336
offered	2337
204	2338
336	2339
308	2340
best[SEP]bowling	2341
overs	2342
agricultural[SEP]use[SEP]([SEP]m[SEP]3[SEP]/[SEP]p[SEP]/[SEP]yr[SEP])[SEP]([SEP]in[SEP]%[SEP])	2343
total[SEP]freshwater[SEP]withdrawal[SEP]([SEP]km[SEP]3[SEP]/[SEP]yr[SEP])	2344
pakistan	2345
runners	2346
wgc[SEP]-[SEP]accenture[SEP]match[SEP]play[SEP]champion	2347
madrid[SEP]masters	2348
who[SEP]knows[SEP]the[SEP]most[SEP]about[SEP]the[SEP]guest[SEP]host[SEP]?[SEP]panelists	2349
panels	2350
music	2351
musical[SEP]guest[SEP]([SEP]song[SEP]performed[SEP])	2352
iin[SEP]ranges	2353
active	2354
guest[SEP]host	2355
effective[SEP]exhaust[SEP]velocity[SEP]([SEP]m[SEP]/[SEP]s[SEP])	2356
specific[SEP]impulse[SEP]([SEP]s[SEP])	2357
sfc[SEP]in[SEP]g[SEP]/[SEP]([SEP]kn·s[SEP])	2358
poll	2359
1[SEP].[SEP]3[SEP]%	2360
pole	2361
1988	2362
team[SEP]([SEP]b[SEP])	2363
match[SEP]date	2364
oct[SEP]30[SEP],[SEP]1989	2365
28[SEP].[SEP]5	2366
using	2367
muzzle[SEP]velocity	2368
cartridge	2369
bullet[SEP]weight	2370
muzzle[SEP]energy	2371
headphone[SEP]model	2372
us[SEP]msrp	2373
headphone[SEP]class	2374
earpads	2375
0[SEP].[SEP]1	2376
term[SEP]began	2377
term[SEP]ended	2378
new[SEP]orleans[SEP]saints	2379
18:00	2380
archive	2381
6[SEP].[SEP]6	2382
bills[SEP]first[SEP]downs	2383
bills[SEP]points	2384
baltimore[SEP]colts	2385
goals[SEP]scored	2386
payout[SEP]([SEP]us[SEP]$[SEP])	2387
regions	2388
%[SEP]of[SEP]total[SEP]deportees	2389
region[SEP]of[SEP]ussr	2390
number[SEP]of[SEP]families	2391
among	2392
operator	2393
line	2394
population[SEP]%[SEP]of[SEP]eu	2395
pop[SEP].[SEP]density[SEP]people[SEP]/[SEP]km[SEP]2	2396
slovakia	2397
1[SEP].[SEP]7[SEP]%	2398
area[SEP]km[SEP]2	2399
greece	2400
tv3	2401
raiders	2402
primary[SEP]conference	2403
wildcats	2404
university	2405
7[SEP].[SEP]0	2406
73	2407
manager	2408
voges[SEP]-[SEP]proskauer	2409
indole	2410
2nd[SEP]place	2411
emission	2412
mid[SEP]-[SEP]atlantic[SEP]south[SEP]([SEP]washington[SEP],[SEP]d[SEP].[SEP]c[SEP].[SEP])	2413
90[SEP]g[SEP]/[SEP]mi[SEP]([SEP]56[SEP]g[SEP]/[SEP]km[SEP])	2414
california[SEP]([SEP]san[SEP]francisco[SEP])	2415
midwest[SEP]([SEP]des[SEP]moines[SEP])	2416
u[SEP].[SEP]s[SEP].[SEP]national[SEP]average[SEP]electric[SEP]mix	2417
test	2418
80[SEP]g[SEP]/[SEP]mi[SEP]([SEP]50[SEP]g[SEP]/[SEP]km[SEP])	2419
population[SEP]([SEP]2011[SEP])	2420
gdp[SEP]adjusted[SEP]([SEP]$[SEP]billions[SEP])	2421
population[SEP]([SEP]millions[SEP])	2422
billion	2423
operating[SEP]profit[SEP]([SEP]s[SEP]$[SEP]m[SEP])	2424
wade[SEP]-[SEP]giles	2425
hsin[SEP]-[SEP]yüan[SEP]-[SEP]i[SEP]-[SEP]ma	2426
released[SEP]date	2427
game[SEP]modes	2428
western[SEP]title	2429
donor[SEP]payment	2430
children[SEP]per[SEP]donor	2431
belgium	2432
levels	2433
tigers	2434
at[SEP]neutral[SEP]site	2435
at[SEP]opponents[SEP]venue	2436
last[SEP]5[SEP]meetings	2437
texas[SEP]tech	2438
series[SEP]sorted	2439
author	2440
length[SEP]feet	2441
kilometers	2442
parishes	2443
railroad	2444
preliminary[SEP]average	2445
semifinal[SEP]average	2446
pop[SEP].[SEP]density[SEP]([SEP]per[SEP]km²[SEP])	2447
largest[SEP]city	2448
languages	2449
language[SEP]([SEP]s[SEP])	2450
2009[SEP]([SEP]82nd[SEP])	2451
217	2452
points[SEP]won	2453
points[SEP]%	2454
audiobook	2455
squared	2456
5[SEP]strokes	2457
woman	2458
gross[SEP]sales	2459
sellout[SEP]([SEP]%[SEP])	2460
tickets[SEP]sold[SEP]/[SEP]available	2461
imperative	2462
10s	2463
9[SEP].[SEP]2	2464
11[SEP].[SEP]1	2465
fare	2466
bobcats	2467
traditional	2468
11[SEP].[SEP]8[SEP]([SEP]74[SEP])	2469
14[SEP].[SEP]12[SEP]([SEP]96[SEP])	2470
adelaide	2471
st[SEP]kilda	2472
footscray	2473
sizes	2474
7[SEP].[SEP]8[SEP]([SEP]50[SEP])	2475
18[SEP].[SEP]12[SEP]([SEP]120[SEP])	2476
brisbane[SEP]lions	2477
contestants	2478
fremantle	2479
private[SEP]/[SEP]catholic	2480
release[SEP]price[SEP]([SEP]usd[SEP])	2481
model[SEP]number	2482
l2[SEP]cache	2483
kickoff	2484
dimensions[SEP]([SEP]mm[SEP])	2485
pages[SEP]per[SEP]minute[SEP]([SEP]color[SEP])	2486
lexington	2487
madison	2488
volleyball	2489
wooster	2490
soccer	2491
cross[SEP]country	2492
softball	2493
basketball	2494
2011[SEP]-[SEP]12	2495
ashland	2496
official[SEP]#	2497
british[SEP]columbia	2498
jeff[SEP]brown	2499
move	2500
max[SEP].[SEP]height[SEP]([SEP]ft[SEP])	2501
gun	2502
shell[SEP]([SEP]lb[SEP])	2503
higher	2504
12[SEP].[SEP]5	2505
time[SEP]to[SEP]ft[SEP]([SEP]m[SEP])[SEP]at[SEP]25°[SEP]([SEP]seconds[SEP])	2506
ratio	2507
degrees	2508
time[SEP]to[SEP]ft[SEP]([SEP]m[SEP])[SEP]at[SEP]55°[SEP]([SEP]seconds[SEP])	2509
18[SEP].[SEP]8	2510
skip	2511
25[SEP]to[SEP]29	2512
30[SEP]to[SEP]34	2513
treasurer	2514
fewest	2515
shot[SEP]%	2516
switzerland	2517
oblast\age	2518
18[SEP]to[SEP]19	2519
65[SEP]to[SEP]69	2520
50[SEP]to[SEP]54	2521
60[SEP]to[SEP]64	2522
35[SEP]to[SEP]39	2523
translation	2524
years[SEP]for[SEP]grizzlies	2525
miles[SEP]([SEP]km[SEP])	2526
june[SEP]7	2527
race[SEP]time	2528
duke	2529
athletes	2530
grizzles	2531
missouri	2532
whre	2533
date[SEP]successor[SEP]seated	2534
because	2535
successor	2536
reason[SEP]for[SEP]change	2537
die	2538
parameter	2539
archbishop	2540
ordained[SEP]bishop	2541
ordained[SEP]priest	2542
vacated[SEP]throne	2543
210	2544
211	2545
tree[SEP]species	2546
258	2547
without	2548
1[SEP],[SEP]213[SEP],[SEP]000[SEP]([SEP]21[SEP]st[SEP])	2549
production[SEP]([SEP]bbl[SEP]/[SEP]day[SEP])	2550
square	2551
target	2552
brand[SEP]name	2553
urban[SEP],[SEP]%	2554
length[SEP]([SEP]m[SEP])	2555
average[SEP]climb[SEP]([SEP]%[SEP])	2556
without[SEP]the[SEP]walls	2557
stolen[SEP]ends[SEP]against	2558
154	2559
other[SEP]name	2560
glucose	2561
plus	2562
bangladesh	2563
451	2564
sydney	2565
falcons[SEP]points	2566
3[SEP]-[SEP]2	2567
atlanta	2568
falcons	2569
4[SEP]-[SEP]4	2570
6[SEP]-[SEP]4	2571
ktm	2572
5[SEP].[SEP]0	2573
26[SEP].[SEP]8	2574
containing	2575
driver[SEP]/[SEP]passenger	2576
tdp	2577
microprocessor	2578
gpu[SEP]frequency	2579
memory	2580
june[SEP]11	2581
please	2582
hawks	2583
surface	2584
clay	2585
republican:[SEP]steve[SEP]sauerberg	2586
dates[SEP]administered	2587
poll[SEP]source	2588
lead[SEP]margin	2589
democrat:[SEP]vivian[SEP]davis[SEP]figures	2590
democrat	2591
democrat:[SEP]carl[SEP]levin	2592
54[SEP]%	2593
latitude	2594
found	2595
longitude	2596
team[SEP]#[SEP]2	2597
team[SEP]#[SEP]1	2598
two	2599
name[SEP]origin	2600
origin	2601
diameter[SEP]([SEP]km[SEP])	2602
every	2603
year[SEP]named	2604
great[SEP]britain	2605
212	2606
measure	2607
narrator	2608
profits[SEP]([SEP]billion[SEP]$[SEP])	2609
billions	2610
sales[SEP]([SEP]billion[SEP]$[SEP])	2611
assets[SEP]([SEP]billion[SEP]$[SEP])	2612
headquartered	2613
china	2614
market[SEP]value[SEP]([SEP]billion[SEP]$[SEP])	2615
index[SEP]weighting[SEP]([SEP]%[SEP])[SEP]at[SEP]17[SEP]january[SEP]2013	2616
oil[SEP]and[SEP]gas	2617
industry	2618
netherlands	2619
dollars	2620
£[SEP]1[SEP]fraction	2621
5304bp[SEP]/[SEP]377aa	2622
host[SEP]([SEP]s[SEP])	2623
prime	2624
website	2625
car[SEP]#	2626
year[SEP]started	2627
flaps	2628
24[SEP].[SEP]8	2629
population[SEP]([SEP]2010[SEP])	2630
equipment	2631
bike[SEP]no	2632
age[SEP]30[SEP]-[SEP]39	2633
religion	2634
hindu	2635
martin	2636
land	2637
immunity	2638
new[SEP]/[SEP]returning[SEP]/[SEP]same[SEP]network	2639
sent	2640
previously	2641
change	2642
last[SEP]aired	2643
190	2644
shares	2645
saka[SEP]era	2646
sign[SEP]of[SEP]zodiac	2647
miami	2648
milwaukee	2649
vacuum[SEP]range	2650
nightly[SEP]rank	2651
episode[SEP]number[SEP]production[SEP]number	2652
no[SEP].[SEP]of[SEP]villages	2653
corresponding	2654
allowed	2655
november[SEP]2	2656
november[SEP]21	2657
april[SEP]7	2658
