<pad>	0
<sos>	1
<eos>	2
<unk>	3
Select	4
agg	5
notes	6
conditions	7
Condition	8
op	9
Equal	10
south[SEP]australia	11
format	12
state[SEP]/[SEP]territory	13
Count	14
fleet[SEP]series[SEP]([SEP]quantity[SEP])	15
fuel[SEP]propulsion	16
manufacturer	17
order[SEP]year	18
1998	19
model	20
2000	21
description	22
aircraft	23
school[SEP]/[SEP]club[SEP]team	24
no[SEP].	25
6	26
years[SEP]in[SEP]toronto	27
position	28
baylor	29
player	30
1995[SEP]-[SEP]96	31
2001[SEP]-[SEP]02	32
2004[SEP]-[SEP]05	33
Min	34
nationality	35
georgetown	36
hawaii	37
georgia	38
connecticut	39
2004	40
la[SEP]salle	41
best[SEP]finish	42
117	43
2nd	44
wins	45
money[SEP]list[SEP]rank	46
183	47
scoring[SEP]average	48
n[SEP]/[SEP]a	49
Max	50
season	51
team	52
metrostars	53
college	54
1	55
10	56
years[SEP]played	57
3[SEP]–[SEP]2	58
doubles[SEP]w[SEP]-[SEP]l	59
0[SEP]–[SEP]0	60
3[SEP]–[SEP]1	61
name	62
375	63
canton	64
consort	65
direction	66
weapon	67
east	68
chapters	69
classification	70
headquarters	71
member	72
sorority	73
12	74
3000	75
year	76
1934	77
smallpox	78
4	79
293	80
1929	81
founded	82
location	83
affiliation	84
school	85
primary[SEP]conference	86
douglas	87
icelandic	88
network	89
season[SEP]premiere	90
ranking	91
season[SEP]finale	92
population[SEP]canada[SEP]2011[SEP]census	93
population	94
county	95
english[SEP]name	96
irish[SEP]name	97
62[SEP]%	98
53[SEP]%	99
chinese	100
filipino	101
indian	102
65	103
tv[SEP]season	104
viewers[SEP]([SEP]millions[SEP])	105
rank	106
39	107
avg[SEP].[SEP]finish	108
2012	109
1983	110
top[SEP]10	111
avg[SEP].[SEP]start	112
poles	113
starts	114
team[SEP]([SEP]s[SEP])	115
centre	116
nhl[SEP]team	117
florida[SEP]panthers	118
united[SEP]states	119
LessThan	120
pick	121
college[SEP]/[SEP]junior[SEP]/[SEP]club[SEP]team	122
st[SEP].[SEP]louis[SEP]blues	123
northern[SEP]ireland	124
3	125
scotland	126
total	127
35	128
wales	129
top[SEP]5	130
9	131
hartford[SEP]whalers	132
new[SEP]york[SEP]islanders	133
vacator	134
district	135
notation	136
formula	137
city	138
cremona	139
region	140
GreaterThan	141
#	142
13	143
193	144
successor	145
date[SEP]of[SEP]successors[SEP]formal[SEP]installation	146
tonioli	147
goodman	148
31	149
horwood	150
7	151
result	152
safe	153
dixon	154
second[SEP]place	155
year[SEP]built	156
no[SEP].[SEP]built	157
points	158
driver	159
mark[SEP]martin	160
winnings	161
actors[SEP]name	162
film[SEP]name	163
nomination	164
country	165
serbia	166
director	167
ukraine	168
total[SEP]goals	169
fa[SEP]cup[SEP]goals	170
fa[SEP]cup[SEP]apps	171
circuit	172
fastest[SEP]lap	173
production[SEP]code	174
title	175
episode[SEP]#	176
227	177
directed[SEP]by	178
written[SEP]by	179
opponents	180
partner	181
score	182
surface	183
champion	184
date[SEP]of[SEP]birth	185
representative	186
party	187
character	188
broadcast[SEP]date	189
20th	190
escherichia	191
espd	192
salmonella	193
shigella	194
original[SEP]title	195
film[SEP]title[SEP]used[SEP]in[SEP]nomination	196
year[SEP]([SEP]ceremony[SEP])	197
camp	198
operational	199
overall	200
round	201
240	202
255	203
player[SEP]name	204
17	205
attendance	206
record	207
7[SEP]-[SEP]3	208
opponent	209
9[SEP]-[SEP]4	210
game	211
8	212
choice	213
quarterback	214
linebacker	215
illinois	216
83	217
rice	218
defensive[SEP]back	219
bullet[SEP]tip[SEP]color	220
white	221
touchdowns	222
completions	223
games[SEP]started	224
yards	225
attempts	226
348	227
london	228
frank	229
class[SEP]aaa	230
school[SEP]year	231
class[SEP]a	232
class[SEP]aaaaa	233
class[SEP]aa	234
team[SEP]record	235
date	236
week	237
game[SEP]site	238
original[SEP]air[SEP]date	239
setting	240
1544	241
no[SEP].[SEP]in[SEP]series	242
29	243
no[SEP].[SEP]in[SEP]season	244
duration	245
piano	246
lyricist	247
romance	248
3:50	249
playoffs	250
league	251
division	252
open[SEP]cup	253
1[SEP]st[SEP]round	254
series	255
podiums	256
2010	257
144	258
writer	259
villains	260
25	261
regular[SEP]season	262
2011	263
11	264
storyteller	265
species	266
2[SEP].[SEP]0	267
4[SEP].[SEP]9	268
sepal[SEP]width	269
5[SEP].[SEP]1	270
3[SEP].[SEP]4	271
sepal[SEP]length	272
5[SEP].[SEP]4	273
2[SEP].[SEP]8	274
6[SEP].[SEP]5	275
2[SEP].[SEP]9	276
1[SEP].[SEP]3	277
report	278
winning[SEP]driver	279
pole[SEP]position	280
al[SEP]unser	281
winning[SEP]team	282
1930	283
1926	284
venezuela	285
1972	286
1977	287
1912	288
introduction	289
discontinued	290
local[SEP]title	291
region[SEP]/[SEP]country	292
bulgaria	293
winners	294
cup[SEP]goals	295
league[SEP]apps	296
premier	297
1970	298
runner[SEP]-[SEP]up	299
richmond	300
milepost	301
commodity	302
wool	303
build[SEP]date	304
disposition	305
institution	306
blazers	307
joined	308
women’s[SEP]nickname	309
left	310
enrollment	311
1500	312
current[SEP]conference	313
1866	314
type	315
date[SEP]of[SEP]vacancy	316
date[SEP]of[SEP]appointment	317
replaced[SEP]by	318
manchester[SEP]city	319
position[SEP]in[SEP]table	320
pre[SEP]-[SEP]season	321
play[SEP]-[SEP]off	322
6[SEP]-[SEP]9	323
private	324
dates[SEP]active	325
pressure	326
deaths	327
average	328
high[SEP]score	329
120	330
50	331
2	332
0	333
inns	334
21	335
general[SEP]election	336
%[SEP]of[SEP]popular[SEP]vote	337
#[SEP]of[SEP]candidates	338
#[SEP]of[SEP]seats[SEP]won	339
80	340
125	341
indianapolis[SEP]colts	342
0[SEP]-[SEP]4	343
stadium	344
memorial[SEP]stadium	345
5	346
probability[SEP]1[SEP]st[SEP]player[SEP]wins	347
2nd[SEP]players[SEP]choice	348
probability[SEP]2nd[SEP]player[SEP]wins	349
nfl[SEP]team	350
pick[SEP]#	351
defensive[SEP]tackle	352
province	353
density	354
area[SEP]([SEP]km²[SEP])	355
u[SEP].[SEP]s[SEP].[SEP]viewers[SEP]([SEP]million[SEP])	356
region[SEP]2	357
dvd[SEP]name	358
2005	359
team[SEP]name	360
2009	361
62	362
10th	363
october[SEP]16	364
race[SEP]name	365
newman[SEP]/[SEP]haas[SEP]racing	366
city[SEP]/[SEP]location	367
lap[SEP]-[SEP]by[SEP]-[SEP]lap	368
host	369
63	370
u[SEP].[SEP]s[SEP].[SEP]viewers[SEP]([SEP]millions[SEP])	371
94	372
113	373
23	374
rnd	375
#[SEP]of[SEP]bids	376
conference	377
round[SEP]of[SEP]32	378
1[SEP].[SEP]0	379
races	380
air[SEP]date	381
challenge	382
village[SEP]([SEP]slovenian[SEP])	383
percent[SEP]of[SEP]slovenes[SEP]1951	384
percent[SEP]of[SEP]slovenes[SEP]1991	385
village[SEP]([SEP]german[SEP])	386
high[SEP]points	387
de	388
cfl[SEP]team	389
winnipeg[SEP]blue[SEP]bombers	390
laval	391
montreal[SEP]alouettes	392
toronto[SEP]argonauts	393
cb	394
new[SEP]mexico	395
ohio[SEP]state	396
introduced	397
ol	398
saskatchewan[SEP]roughriders	399
episodes	400
t5120	401
ru	402
sport	403
premier[SEP]league	404
average[SEP]attendance	405
2013	406
year[SEP][e[SEP]][SEP]([SEP]ceremony[SEP])	407
finale	408
chinese[SEP]title	409
潮爆大狀	410
hk[SEP]viewers	411
premiere	412
34	413
peak	414
writer[SEP]([SEP]s[SEP])	415
orbital[SEP]period	416
semimajor[SEP]axis[SEP]([SEP]au[SEP])	417
planet	418
jupiter	419
saskatchewan	420
mcmaster	421
oklahoma	422
height	423
weight	424
320	425
db	426
calgary[SEP]stampeders	427
york	428
27	429
fb	430
regina	431
lb	432
43	433
release[SEP]date	434
reference	435
japanese[SEP]title	436
romaji[SEP]title	437
oricon	438
partial[SEP]thromboplastin[SEP]time	439
condition	440
prothrombin[SEP]time	441
unaffected	442
bleeding[SEP]time	443
prolonged	444
platelet[SEP]count	445
tuesday	446
wednesday	447
monday	448
thursday	449
saturday	450
sunday	451
original[SEP]name	452
area[SEP]in[SEP]km²	453
colour	454
interregnum[SEP]ended	455
series[SEP]#	456
36	457
38	458
%	459
manhattan	460
queens	461
richmond[SEP][staten[SEP]is[SEP].[SEP]]	462
brooklyn	463
central	464
2[SEP].[SEP]61	465
3[SEP].[SEP]6	466
79	467
audition[SEP]city	468
callback[SEP]venue	469
episode[SEP]air[SEP]date	470
owned[SEP]since	471
city[SEP]of[SEP]license[SEP]/[SEP]market	472
channel[SEP]tv[SEP]([SEP]dt[SEP])	473
2002	474
station	475
engine	476
performance	477
turbo	478
trim	479
torque	480
transmission	481
power	482
english[SEP]title	483
33	484
42	485
weekly[SEP]rank	486
episode	487
viewers[SEP]([SEP]m[SEP])	488
rating	489
5[SEP].[SEP]3	490
highest	491
balmoor	492
capacity	493
ayr[SEP]united	494
galway	495
outgoing[SEP]manager	496
1[SEP]credit	497
3[SEP]credits	498
180	499
hand	500
4[SEP]credits	501
1600	502
5[SEP]credits	503
actor	504
manner[SEP]of[SEP]departure	505
lowest	506
cappielow	507
st[SEP].[SEP]johnstone	508
semi[SEP]-[SEP]finalist[SEP]#[SEP]2	509
na	510
2007	511
north[SEP]carolina[SEP]state	512
numer[SEP]of[SEP]jamaicans[SEP]granted[SEP]british[SEP]citizenship	513
114	514
927	515
281	516
first[SEP]air[SEP]date	517
finish	518
15	519
catalog[SEP]number	520
studio	521
copyright[SEP]information	522
losingteam	523
1993	524
compression[SEP]ratio	525
7:1	526
winningteam	527
6[SEP].[SEP]3	528
share	529
18[SEP]-[SEP]49[SEP]([SEP]rating[SEP]/[SEP]share[SEP])	530
first[SEP]appearance	531
last[SEP]appearance	532
relationship	533
portrayed[SEP]by	534
top[SEP]division[SEP]titles	535
number[SEP]of[SEP]seasons[SEP]in[SEP]top[SEP]division	536
rank[SEP]([SEP]week[SEP])	537
20	538
rank[SEP]([SEP]timeslot[SEP])	539
rank[SEP]([SEP]night[SEP])	540
1[SEP].[SEP]4	541
russia	542
india	543
rank[SEP]([SEP]#[SEP])	544
points[SEP]awarded[SEP]([SEP]platinum[SEP])	545
5th	546
70	547
85	548
timeslot	549
extroverted[SEP],[SEP]relationship[SEP]-[SEP]oriented	550
moderate	551
founder	552
ether	553
batting[SEP]team	554
runs	555
276	556
fielding[SEP]team	557
durham	558
batting[SEP]partners	559
155	560
226	561
stumpings	562
rank[SEP]([SEP]wjc[SEP])	563
metro[SEP]area	564
los[SEP]angeles	565
number[SEP]of[SEP]jews[SEP]([SEP]wjc[SEP])	566
rank[SEP]([SEP]arda[SEP])	567
philadelphia	568
bgs	569
u15[SEP]3rd[SEP]iv	570
bbc	571
gt	572
crew	573
acgs	574
enrolment	575
850	576
abbreviation	577
1990	578
stm	579
rd[SEP].	580
grand[SEP]prix	581
monaco[SEP]grand[SEP]prix	582
french[SEP]grand[SEP]prix	583
michael[SEP]schumacher	584
constructor	585
ferrari	586
canadian[SEP]grand[SEP]prix	587
outcome	588
2r	589
against	590
overall[SEP]rank	591
modena	592
winning[SEP]constructor	593
riccardo[SEP]patrese	594
interlagos	595
german[SEP]grand[SEP]prix	596
portuguese[SEP]grand[SEP]prix	597
hockenheimring	598
silverstone	599
android	600
windows	601
other	602
0[SEP].[SEP]7[SEP]%	603
source	604
japanese[SEP]orthography	605
foundation	606
1964	607
half[SEP]marathon[SEP]([SEP]womens[SEP])	608
kazakhstan	609
moldova	610
jerez	611
detroit	612
nigel[SEP]mansell	613
season[SEP]result	614
7th	615
9th	616
grand[SEP]finalist	617
collingwood	618
margin	619
51	620
scores	621
crowd	622
venue	623
south[SEP]melbourne	624
race	625
alain[SEP]prost	626
race[SEP]winner	627
essendon	628
runner[SEP]up	629
hawthorn	630
premiership	631
geelong	632
patrick[SEP]tambay	633
nürburgring	634
kyalami	635
john[SEP]watson	636
monza	637
argentine[SEP]grand[SEP]prix	638
italian[SEP]grand[SEP]prix	639
renault	640
james[SEP]hunt	641
oulton[SEP]park	642
niki[SEP]lauda	643
jean[SEP]-[SEP]pierre[SEP]jarier	644
clay[SEP]regazzoni	645
posillipo	646
pau	647
juan[SEP]manuel[SEP]fangio	648
syracuse	649
bordeaux	650
goodwood	651
episode[SEP]title	652
pct[SEP]%	653
won	654
standing	655
games	656
liscumb	657
gauthier	658
bello	659
ben[SEP]-[SEP]tahir	660
296	661
haydon	662
libweshya	663
doucet	664
lawrance	665
tv	666
kickoff[SEP][a[SEP]]	667
house[SEP]name	668
colours	669
green	670
composition	671
benue	672
minnesota[SEP]vikings	673
1[SEP]-[SEP]3	674
fourth[SEP]place	675
2003	676
engine[SEP]type	677
max[SEP].[SEP]torque[SEP]at[SEP]rpm	678
torque[SEP]([SEP]nm@rpm[SEP])	679
comment	680
model[SEP]name	681
engine[SEP]code	682
47	683
turkey	684
years[SEP]for[SEP]jazz	685
creighton	686
marshall	687
oregon	688
minnesota	689
iowa[SEP]state	690
shooting[SEP]guard	691
byu	692
maryland	693
54	694
2010[SEP]-[SEP]11	695
53	696
utep	697
1[SEP]st[SEP]ship[SEP]delivery[SEP]date	698
ship[SEP]types[SEP]delivered	699
111	700
4th[SEP]place	701
3rd[SEP]place	702
1[SEP]st[SEP]place	703
2001	704
runner[SEP]([SEP]s[SEP])[SEP]-[SEP]up	705
margin[SEP]of[SEP]victory	706
54[SEP]holes	707
name[SEP]of[SEP]ground	708
cuts[SEP]made	709
cylinders	710
builder	711
wheel[SEP]arrangement	712
number	713
frequency	714
model[SEP]number	715
part[SEP]number[SEP]([SEP]s[SEP])	716
fsb	717
socket	718
sspec[SEP]number	719
tournament	720
michigan	721
purse[SEP]([SEP]$[SEP])	722
nickname	723
color	724
1918	725
arizona	726
state[SEP]&[SEP]federal	727
seat	728
lublin	729
hosted	730
last[SEP]year	731
football[SEP]park	732
port[SEP]adelaide	733
winner	734
may[SEP]28	735
1[SEP]st[SEP]prize[SEP]([SEP]$[SEP])	736
virginia	737
rhode[SEP]island	738
series[SEP]no[SEP].	739
season[SEP]#	740
61	741
311	742
partnering	743
6[SEP]–[SEP]3[SEP],[SEP]6[SEP]–[SEP]2	744
celebrity	745
viewers	746
503	747
514	748
2008	749
married[SEP]filing[SEP]separately	750
head[SEP]of[SEP]household	751
single	752
married[SEP]filing[SEP]jointly[SEP]or[SEP]qualified[SEP]widow[SEP]([SEP]er[SEP])	753
coach	754
captain	755
win[SEP]/[SEP]loss	756
disaster	757
2005[SEP]-[SEP]06	758
peru	759
capital	760
voivodeship	761
1880	762
gross[SEP]tonnage	763
ships[SEP]name	764
munich	765
1923	766
1913	767
date[SEP]entered[SEP]service	768
zeeland	769
tonnage	770
date[SEP]withdrawn	771
18	772
third[SEP]place	773
mlb[SEP]draft	774
hometown	775
catcher	776
pitcher	777
south[SEP]carolina	778
stanford	779
running[SEP]back	780
nebraska	781
nba[SEP]draft	782
kentucky	783
ratings	784
1997	785
vehlefanz	786
bärenklau	787
schwante	788
365	789
quit	790
cpu	791
year[SEP]released	792
ram	793
director[SEP]([SEP]s[SEP])	794
school[SEP]/[SEP]club[SEP]team[SEP]/[SEP]country	795
purdue	796
no[SEP].[SEP]([SEP]s[SEP])	797
height[SEP]in[SEP]ft[SEP].	798
years[SEP]for[SEP]rockets	799
6[SEP]-[SEP]0	800
2006	801
7[SEP]-[SEP]0	802
6[SEP]-[SEP]6	803
guard[SEP]/[SEP]forward	804
32	805
55	806
suburb	807
density[SEP]([SEP]/[SEP]km²[SEP])	808
friday	809
clemson	810
t20[SEP]matches	811
fc[SEP]matches	812
unit	813
commander	814
complement	815
wounded	816
killed	817
gdp[SEP]([SEP]nominal[SEP])	818
$[SEP]29[SEP].[SEP]9[SEP]billion	819
uzbekistan	820
aspect[SEP]ratio	821
released	822
missing	823
forward	824
club[SEP]team	825
126	826
78	827
state	828
mississippi	829
track	830
fantasy	831
gt2[SEP]winning[SEP]team	832
esp	833
p	834
mf	835
first[SEP]day[SEP]cover[SEP]cancellation	836
theme	837
design	838
paper[SEP]type	839
illustration	840
meaning	841
high[SEP]assists	842
49	843
high[SEP]rebounds	844
station[SEP]number	845
c03	846
registrations	847
25[SEP],[SEP]000	848
artist	849
first[SEP]class[SEP]team	850
bowling[SEP]style	851
batting[SEP]style	852
musical[SEP]guest[SEP]and[SEP]song	853
location[SEP]attendance	854
november[SEP]24	855
november[SEP]4	856
march[SEP]26	857
april[SEP]25	858
january[SEP]23	859
san[SEP]antonio	860
november[SEP]15	861
67	862
december[SEP]12	863
57	864
@[SEP]milwaukee	865
24	866
december[SEP]8	867
april[SEP]20	868
may[SEP]11	869
march[SEP]17	870
streak	871
home	872
leading[SEP]scorer	873
26	874
december[SEP]2	875
february[SEP]21	876
march[SEP]27	877
visitor	878
phoenix[SEP]suns	879
april[SEP]29	880
preliminaries	881
evening[SEP]gown	882
interview	883
swimsuit	884
reg[SEP].[SEP]season	885
4th	886
1992	887
status	888
entrant	889
joe[SEP]gibbs[SEP]racing	890
laps	891
author[SEP]/[SEP]editor[SEP]/[SEP]source	892
countries[SEP]sampled	893
year[SEP]of[SEP]publication	894
ranking[SEP]l[SEP].[SEP]a[SEP].[SEP]([SEP]2[SEP])	895
world[SEP]ranking[SEP]([SEP]1[SEP])	896
1989	897
womens[SEP]doubles	898
womens[SEP]singles	899
mixed[SEP]doubles	900
mens[SEP]singles	901
simplified	902
pinyin	903
area	904
nhl[SEP]team[SEP]([SEP]s[SEP])	905
metropolitan[SEP]area	906
blackhawks	907
nuggets	908
vendor[SEP]and[SEP]type	909
comments	910
implementation	911
for[SEP]prohibition	912
jurisdiction	913
percent[SEP]for	914
against[SEP]prohibition	915
manitoba	916
train[SEP]name	917
origin	918
train[SEP]no[SEP].	919
destination	920
year[SEP]([SEP]s[SEP])	921
human[SEP]resources[SEP]&[SEP]operations	922
built	923
rebuilt	924
torque[SEP]([SEP]nm[SEP])[SEP]/[SEP]rpm	925
model[SEP]/[SEP]engine	926
power[SEP]/[SEP]rpm	927
president	928
date[SEP]of[SEP]inauguration	929
4june1979	930
winning[SEP]pitcher	931
june[SEP]25	932
may[SEP]20	933
losing[SEP]pitcher	934
new[SEP]york[SEP]rangers	935
chicago[SEP]black[SEP]hawks	936
buffalo[SEP]sabres	937
canada	938
philadelphia[SEP]flyers	939
89	940
minnesota[SEP]north[SEP]stars	941
detroit[SEP]red[SEP]wings	942
goaltender	943
norway	944
third	945
italy	946
finland	947
sweden	948
jenson[SEP]button	949
science	950
first[SEP]year	951
mens[SEP]doubles	952
.[SEP]308[SEP]winchester[SEP]cartridge[SEP]type	953
300[SEP]m[SEP]group[SEP]([SEP]moa[SEP])	954
45	955
afl[SEP]team	956
cincinnati[SEP]bengals	957
translation	958
subject	959
chapter	960
motogp[SEP]winner	961
125cc[SEP]winner	962
titles	963
arrival	964
operator	965
calling[SEP]at	966
colors	967
1[SEP]usd[SEP]=	968
paraguay	969
1[SEP]euro[SEP]=	970
currency	971
14	972
28	973
136	974
class	975
note	976
ship[SEP]name	977
young[SEP]rider[SEP]classification	978
stage	979
general[SEP]classification	980
1a	981
intergiro[SEP]classification	982
trofeo[SEP]fast[SEP]team	983
16	984
tfr[SEP]2006	985
isolation[SEP]([SEP]km[SEP])	986
elevation[SEP]([SEP]m[SEP])	987
municipality	988
sunndal	989
reverse	990
swimming	991
denomination	992
football	993
nation	994
nigeria	995
fastest[SEP]time[SEP]([SEP]s[SEP])	996
runners[SEP]-[SEP]up	997
malaysia	998
vietnam	999
eliminated	1000
goals	1001
matches	1002
period	1003
athlete	1004
mexico[SEP]city	1005
broadcast[SEP]order	1006
number[SEP]in[SEP]series	1007
u[SEP].[SEP]s[SEP].[SEP]air[SEP]date	1008
new[SEP]york	1009
nevada	1010
competition	1011
power[SEP]([SEP]kw[SEP])	1012
ch[SEP].[SEP]#	1013
callsign	1014
station[SEP]type	1015
relay	1016
5kw	1017
running	1018
shooting	1019
athlete[SEP]([SEP]noc[SEP])	1020
riding	1021
fencing	1022
total[SEP]viewers[SEP]([SEP]in[SEP]millions[SEP])	1023
english[SEP]spelling	1024
hebrew[SEP]word	1025
5418	1026
1981	1027
local[SEP]name	1028
length	1029
year[SEP]opened	1030
1995	1031
1950	1032
340	1033
668	1034
overall[SEP]record	1035
club	1036
dallas[SEP]burn	1037
goals[SEP]for	1038
prize[SEP]money	1039
307	1040
sector	1041
gatunda	1042
biggenden	1043
1947	1044
total[SEP]region	1045
perry	1046
304	1047
1882	1048
goals[SEP]against	1049
date[SEP]([SEP]from[SEP])	1050
date[SEP]([SEP]to[SEP])	1051
1919	1052
livingstone	1053
fitzroy	1054
rockhampton	1055
population[SEP]([SEP]glengallan[SEP])	1056
population[SEP]([SEP]region[SEP]total[SEP])	1057
population[SEP]([SEP]rosenthal[SEP])	1058
1548	1059
launched	1060
ship	1061
namesake	1062
laid[SEP]down	1063
program	1064
focus	1065
teaching[SEP]language	1066
duration[SEP]([SEP]years[SEP])	1067
1[SEP].[SEP]5	1068
3[SEP].[SEP]5	1069
song[SEP]title	1070
owner[SEP]([SEP]s[SEP])	1071
driver[SEP]([SEP]s[SEP])	1072
primary[SEP]sponsor[SEP]([SEP]s[SEP])	1073
crew[SEP]chief	1074
started	1075
loan[SEP]club	1076
clapham	1077
republican	1078
committee	1079
democratic	1080
pos	1081
molecular[SEP]target	1082
compound[SEP]name	1083
trademark	1084
chemical[SEP]class	1085
l3	1086
clock[SEP]speed	1087
league[SEP]cup	1088
sequencer	1089
solidv4	1090
pacbio	1091
phillips	1092
dance	1093
jive	1094
week[SEP]#	1095
slovene	1096
polish	1097
croatian	1098
thursday[SEP]day[SEP]five	1099
april[SEP]13	1100
lost	1101
points[SEP]against	1102
714	1103
drawn	1104
tries[SEP]against	1105
30	1106
try[SEP]bonus	1107
tries[SEP]for	1108
64	1109
450	1110
46	1111
points[SEP]for	1112
496	1113
losing[SEP]bonus	1114
445	1115
played	1116
60	1117
389	1118
438	1119
76	1120
earnings[SEP]([SEP]€[SEP])	1121
19	1122
barrel[SEP]length	1123
city[SEP]/[SEP]town	1124
rain	1125
1966	1126
barrel[SEP]twist	1127
barrel[SEP]profile	1128
a1	1129
stock	1130
a2	1131
weaver	1132
muzzle[SEP]device	1133
colt[SEP]model[SEP]no[SEP].	1134
distance	1135
41	1136
background	1137
candidate	1138
constituency	1139
electorate	1140
original[SEP]airdate	1141
episode[SEP]5	1142
no	1143
current[SEP]club	1144
panathinaikos	1145
center	1146
year[SEP]born	1147
real[SEP]madrid	1148
1980	1149
viewers[SEP]([SEP]in[SEP]millions[SEP])	1150
construction[SEP]start	1151
commercial[SEP]operation	1152
total[SEP]viewers	1153
episode[SEP]number	1154
series[SEP]number	1155
new[SEP]jersey	1156
delaware	1157
pennsylvania	1158
head[SEP]coach	1159
new[SEP]hampshire	1160
pts[SEP]for	1161
pts[SEP]agst	1162
645	1163
860	1164
616	1165
vice[SEP]-[SEP]captain	1166
international[SEP]marquee	1167
masters[SEP]tournament	1168
winning[SEP]score	1169
1987	1170
earnings[SEP]([SEP]$[SEP])	1171
174	1172
kerry[SEP]#	1173
cook	1174
bush[SEP]#	1175
others[SEP]#	1176
bush%	1177
the[SEP]mole	1178
airdate	1179
others%	1180
steals	1181
blocks	1182
rebounds	1183
silver[SEP]medals	1184
gold[SEP]medals	1185
ensemble	1186
total[SEP]medals	1187
gt3[SEP]winner	1188
edge	1189
diameter	1190
mass	1191
member[SEP]countries	1192
lithuania	1193
gdp[SEP]([SEP]billion[SEP]us[SEP]$[SEP])	1194
gdp[SEP]per[SEP]capita[SEP]([SEP]us[SEP]$[SEP])	1195
austria	1196
qualifying[SEP]score	1197
event	1198
1[SEP]st[SEP]runner[SEP]up	1199
mediator	1200
release	1201
april[SEP]8	1202
ast	1203
san[SEP]diego[SEP]chargers	1204
kansas[SEP]city[SEP]chiefs	1205
2[SEP]-[SEP]2	1206
0[SEP]-[SEP]1	1207
1[SEP]-[SEP]1	1208
kingdome	1209
mile[SEP]high[SEP]stadium	1210
los[SEP]angeles[SEP]rams	1211
185	1212
95	1213
phil[SEP]mickelson	1214
reset[SEP]points	1215
events	1216
lose	1217
qf	1218
chile	1219
asians	1220
whites	1221
native[SEP]american	1222
david[SEP]duchovny	1223
22	1224
completed	1225
building	1226
address	1227
storeys	1228
complete[SEP]series	1229
region[SEP]4	1230
region[SEP]1	1231
tba	1232
522	1233
68	1234
52	1235
originalairdate	1236
prod[SEP].[SEP]code	1237
candidates	1238
incumbent	1239
first[SEP]elected	1240
massachusetts[SEP]3	1241
results	1242
1994	1243
re[SEP]-[SEP]elected	1244
south[SEP]carolina[SEP]3	1245
south[SEP]carolina[SEP]4	1246
1984	1247
1969	1248
1974	1249
washington[SEP]7	1250
1982	1251
elected	1252
1958	1253
1952	1254
1976	1255
1960	1256
louisiana[SEP]5	1257
1940	1258
1954	1259
carl[SEP]vinson	1260
1961	1261
1942	1262
arkansas[SEP]2	1263
1936	1264
1914	1265
1956	1266
1944	1267
1938	1268
1932	1269
1941	1270
1920	1271
1946	1272
1948	1273
1943	1274
william[SEP]j[SEP].[SEP]driver	1275
1922	1276
1927	1277
1916	1278
mascot	1279
panthers	1280
eagles	1281
titans	1282
height[SEP]([SEP]ft[SEP])	1283
call[SEP]sign	1284
target[SEP]city[SEP]/[SEP]market	1285
city[SEP]of[SEP]license	1286
owner	1287
alternative	1288
3rd	1289
per[SEP]capita[SEP]income	1290
place	1291
number[SEP]of[SEP]households	1292
barrier	1293
jockey	1294
trainer	1295
radio[SEP]electrical	1296
secretariat	1297
electrical	1298
mechanical	1299
regulating	1300
lpm	1301
most[SEP]laps[SEP]led	1302
scott[SEP]dixon	1303
graham[SEP]rahal	1304
kansas	1305
boston	1306
current[SEP]status	1307
fox	1308
1986	1309
umpires	1310
180s	1311
sets[SEP]won	1312
140[SEP]+	1313
new[SEP]channel[SEP]([SEP]s[SEP])	1314
programme	1315
gladiators	1316
couple	1317
number[SEP]of[SEP]dances	1318
rank[SEP]by[SEP]average	1319
gender	1320
senior[SEP]high[SEP]school[SEP]([SEP]15[SEP]–[SEP]18[SEP]yrs[SEP])	1321
specification	1322
male	1323
1[SEP]-[SEP]2	1324
charlotte	1325
utah	1326
march[SEP]7	1327
72	1328
vancouver	1329
april[SEP]12	1330
92	1331
325	1332
321	1333
547	1334
group	1335
winner[SEP]/[SEP]2nd	1336
6th	1337
weight[SEP]([SEP]kg[SEP])	1338
g3	1339
distribution	1340
gentoo	1341
grsecurity	1342
yes	1343
unknown	1344
parish	1345
randwick	1346
rosehill	1347
time	1348
income[SEP]poverty[SEP]f	1349
6[SEP].[SEP]9	1350
san[SEP]juan	1351
january[SEP]3	1352
april[SEP]1	1353
66	1354
1[SEP]-[SEP]4	1355
seattle	1356
portland	1357
1985[SEP]-[SEP]1990	1358
1995[SEP]-[SEP]2000	1359
2000[SEP]-[SEP]2005	1360
1990[SEP]-[SEP]1995	1361
total[SEP]population	1362
catholic	1363
title[SEP]and[SEP]source	1364
gto[SEP]winning[SEP]team	1365
to[SEP]winning[SEP]team	1366
149	1367
11[SEP].[SEP]8	1368
1[SEP].[SEP]1	1369
spokesperson	1370
may[SEP]21	1371
w[SEP]-[SEP]l[SEP]-[SEP]d	1372
games[SEP]played	1373
gie	1374
date[SEP]announced	1375
date[SEP]completed	1376
546	1377
523	1378
536	1379
404	1380
353	1381
565	1382
77	1383
percentage[SEP]of[SEP]votes	1384
112	1385
election[SEP]date	1386
high[SEP]school	1387
vikings	1388
delta[SEP]center	1389
november[SEP]25	1390
6[SEP]-[SEP]3	1391
country[SEP]/[SEP]region	1392
seasons[SEP]and[SEP]winners	1393
judges	1394
presenters	1395
chroma[SEP]format	1396
high[SEP]profile	1397
highest[SEP]position	1398
transit[SEP]passengers	1399
international[SEP]passengers	1400
freight[SEP]([SEP]metric[SEP]tonnes[SEP])	1401
airport	1402
edinburgh	1403
change[SEP]2008[SEP]/[SEP]09	1404
liverpool	1405
total[SEP]passengers	1406
827	1407
1978	1408
area[SEP]([SEP]km[SEP]2[SEP])	1409
population[SEP]([SEP]2000[SEP])	1410
319	1411
556	1412
vineyard[SEP]surface[SEP]([SEP]2010[SEP])	1413
grand[SEP]cru	1414
village	1415
wine[SEP]style	1416
red[SEP]wine	1417
frequency[SEP]mhz	1418
height[SEP]m[SEP]([SEP]ft[SEP])	1419
fcc[SEP]info	1420
734	1421
decreased[SEP]or[SEP]unaffected	1422
decreased	1423
delegate	1424
counties[SEP]represented	1425
town	1426
arena[SEP]([SEP]capacity[SEP])	1427
race[SEP]title	1428
hidden[SEP]valley[SEP]raceway	1429
queensland[SEP]raceway	1430
green[SEP]bay[SEP]packers	1431
code	1432
population[SEP]census[SEP]2009	1433
chassis	1434
1979	1435
foyt	1436
mclaren	1437
offenhauser	1438
virtual[SEP]channel	1439
9[SEP].[SEP]1	1440
digital[SEP]channel	1441
350	1442
177	1443
84	1444
596	1445
643	1446
telugu[SEP]తెలుగు	1447
mongolian	1448
75	1449
490	1450
48	1451
buenos[SEP]aires	1452
uruguay	1453
santiago	1454
voice[SEP]actor[SEP]([SEP]english[SEP]1998[SEP]/[SEP]pioneer[SEP])	1455
character[SEP]name	1456
voice[SEP]actor[SEP]([SEP]japanese[SEP])	1457
national[SEP]titles	1458
mission	1459
primary[SEP]payload[SEP]([SEP]s[SEP])	1460
launch[SEP]date	1461
shuttle	1462
columbia	1463
pts	1464
nc	1465
motorcycle	1466
aprilia	1467
250cc	1468
81	1469
defensive	1470
month	1471
february	1472
rookie	1473
offensive	1474
transition	1475
3a	1476
established	1477
1973	1478
1924	1479
middle	1480
students	1481
pupil[SEP]/[SEP]teacher[SEP]ratio	1482
congress	1483
lowest[SEP]point	1484
texas	1485
highest[SEP]point	1486
language	1487
genre	1488
decade	1489
1980s	1490
1990s	1491
home[SEP]([SEP]1[SEP]st[SEP]leg[SEP])	1492
aggregate	1493
home[SEP]([SEP]2nd[SEP]leg[SEP])	1494
1[SEP]st[SEP]leg	1495
2[SEP]-[SEP]0	1496
belgrano	1497
2nd[SEP]leg	1498
platense	1499
2[SEP]-[SEP]4	1500
cast	1501
2nd[SEP]round	1502
conference[SEP]semifinals	1503
did[SEP]not[SEP]qualify	1504
16[SEP].[SEP]5	1505
fleet[SEP]numbers	1506
channels	1507
designation	1508
clock[SEP]rate[SEP]([SEP]mhz[SEP])	1509
2400	1510
principal[SEP]([SEP]2013[SEP]-[SEP]2014[SEP])	1511
%[SEP]change	1512
8[SEP].[SEP]8	1513
population[SEP]rank	1514
8[SEP].[SEP]4	1515
win	1516
run[SEP]time	1517
8[SEP].[SEP]2	1518
1900	1519
leicester	1520
country[SEP]/[SEP]territory	1521
new[SEP]zealand	1522
aruba	1523
spain	1524
away[SEP]team	1525
home[SEP]team	1526
carlton	1527
ground	1528
scg	1529
away[SEP]team[SEP]score	1530
6[SEP].[SEP]9[SEP]([SEP]45[SEP])	1531
north[SEP]melbourne	1532
extra[SEP]points	1533
field[SEP]goals	1534
extra[SEP]points[SEP]1[SEP]point	1535
total[SEP]points	1536
starter	1537
clark	1538
heston	1539
comedian	1540
main[SEP]presenter	1541
finished	1542
famous[SEP]for	1543
entered	1544
exited	1545
1991[SEP]-[SEP]92	1546
1992[SEP]-[SEP]93	1547
37	1548
birth[SEP]date	1549
shirt[SEP]no	1550
1989[SEP]-[SEP]90	1551
river[SEP]plate	1552
3[SEP].[SEP]2	1553
44	1554
40	1555
economic[SEP]class	1556
1[SEP]st[SEP]([SEP]m[SEP])	1557
2nd[SEP]([SEP]m[SEP])	1558
overall[SEP]wc[SEP]points[SEP]([SEP]rank[SEP])	1559
122[SEP].[SEP]5	1560
original[SEP]air[SEP]date[SEP]([SEP]atv[SEP])	1561
episode[SEP]no[SEP].	1562
fin	1563
shea[SEP]stadium	1564
astrodome	1565
home[SEP]team[SEP]score	1566
rich[SEP]stadium	1567
clubs	1568
member[SEP]association	1569
1987[SEP]-[SEP]88	1570
1988[SEP]-[SEP]89	1571
san[SEP]lorenzo	1572
version	1573
provider	1574
application	1575
1986[SEP]-[SEP]87	1576
argentinos[SEP]juniors	1577
tour	1578
channel	1579
top[SEP]prize	1580
milan	1581
ireland	1582
situation	1583
date[SEP]of[SEP]situation	1584
discs	1585
australia	1586
total[SEP]wins	1587
losses	1588
females[SEP]([SEP]%[SEP])	1589
maharashtra	1590
class[SEP]aaaa	1591
2006[SEP]-[SEP]07	1592
2002[SEP]-[SEP]03	1593
plains	1594
lubbock	1595
canadian	1596
franklin	1597
lindsay	1598
29[SEP]-[SEP]7	1599
postseason	1600
argyle	1601
fs	1602
physical	1603
branding	1604
virtual	1605
nbc	1606
carthage	1607
author	1608
august[SEP]10	1609
september[SEP]7	1610
social[SEP]democratic	1611
left[SEP]bloc	1612
date[SEP]released	1613
green[SEP]-[SEP]communist	1614
8[SEP].[SEP]9[SEP]%	1615
socialist	1616
florida[SEP]state	1617
269	1618
tight[SEP]end	1619
western[SEP]kentucky	1620
wide[SEP]receiver	1621
arizona[SEP]state	1622
penn[SEP]state	1623
usc	1624
placekicker	1625
denver[SEP]broncos	1626
detroit[SEP]lions	1627
tampa[SEP]bay[SEP]buccaneers	1628
louisiana	1629
station[SEP]code	1630
awy	1631
station[SEP]name	1632
2004[SEP]–[SEP]05	1633
5088	1634
2011[SEP]–[SEP]12	1635
2008[SEP]–[SEP]09	1636
years	1637
402	1638
mountains[SEP]classification	1639
points[SEP]classification	1640
right[SEP]wing	1641
132	1642
vancouver[SEP]canucks	1643
borough	1644
weslaco	1645
marion	1646
tunisia	1647
change[SEP]([SEP]2010[SEP]to[SEP]2011[SEP])	1648
international[SEP]tourist[SEP]arrivals[SEP]([SEP]2011[SEP])	1649
senegal	1650
change[SEP]([SEP]2011[SEP]to[SEP]2012[SEP])	1651
international[SEP]tourist[SEP]arrivals[SEP]([SEP]2012[SEP])	1652
united[SEP]kingdom	1653
arranger	1654
4:29	1655
females[SEP]rank	1656
states	1657
karnataka	1658
pilot	1659
population[SEP]([SEP]2005[SEP])	1660
population[SEP]density[SEP]([SEP]/[SEP]km[SEP]2[SEP])	1661
3[SEP]-[SEP]dart[SEP]average	1662
t4	1663
t2	1664
56	1665
2[SEP]credits	1666
straight	1667
200	1668
team[SEP]classification	1669
altitude[SEP]([SEP]km[SEP])	1670
explosion	1671
539	1672
nacional	1673
conceded	1674
draws	1675
tacuary	1676
first[SEP]downs	1677
buffalo[SEP]bills	1678
skipper	1679
yacht	1680
elapsed[SEP]time[SEP]d:hh:mm:ss	1681
yacht[SEP]type	1682
race[SEP]number	1683
sail[SEP]number	1684
loa[SEP]([SEP]metres[SEP])	1685
athletes	1686
229	1687
scored	1688
libertad	1689
no[SEP]competition	1690
performer[SEP]2	1691
performer[SEP]3	1692
performer[SEP]1	1693
performer[SEP]4	1694
stuart	1695
songs	1696
seats[SEP]won	1697
new[SEP]york[SEP]jets	1698
dallas[SEP]cowboys	1699
europe	1700
fa[SEP]cup	1701
142	1702
139	1703
indonesia	1704
hong[SEP]kong	1705
98	1706
chicago[SEP]bears	1707
flamengo	1708
cruzeiro	1709
new[SEP]classification	1710
new[SEP]conference	1711
team[SEP]nickname	1712
san[SEP]francisco[SEP]49ers	1713
0[SEP]–[SEP]1	1714
population[SEP]([SEP]2010[SEP]census[SEP])	1715
population[SEP]2000[SEP]census	1716
administrative[SEP]division	1717
morning	1718
southern[SEP]lakota	1719
1996	1720
viewing[SEP]figure	1721
puerto[SEP]rico	1722
2nd[SEP]runner[SEP]-[SEP]up	1723
license	1724
software	1725
sbagen	1726
english	1727
french	1728
spanish	1729
german	1730
russian	1731
italian	1732
fall[SEP]06	1733
3821	1734
fall[SEP]05	1735
fall[SEP]09	1736
north[SEP]carolina	1737
colorado	1738
vermont	1739
pf	1740
ends[SEP]lost	1741
shot[SEP]pct[SEP].	1742
blank[SEP]ends	1743
locale	1744
l	1745
stolen[SEP]ends	1746
alessandro[SEP]petacchi	1747
alejandro[SEP]valverde	1748
26th	1749
18[SEP].[SEP]4	1750
78th	1751
to[SEP]par	1752
framed[SEP]size	1753
attribute	1754
category	1755
reset	1756
position[SEP]in[SEP]2012[SEP]–[SEP]13	1757
byron[SEP]nelson	1758
us[SEP]open	1759
stage[SEP]winner	1760
malaysian[SEP]rider[SEP]classification	1761
suhardi[SEP]hassan	1762
japan	1763
nominee	1764
vote[SEP]to[SEP]save	1765
nan	1766
segment[SEP]c	1767
series[SEP]ep[SEP].	1768
segment[SEP]d	1769
segment[SEP]b	1770
segment[SEP]a	1771
netflix	1772
167	1773
162	1774
jeans	1775
s08e04	1776
tequila	1777
242	1778
237	1779
bowl[SEP]game	1780
derby[SEP]county	1781
engines	1782
uk[SEP]broadcast[SEP]date	1783
countries[SEP]visited	1784
usa	1785
presenter	1786
control	1787
labour	1788
tujia[SEP]population	1789
%[SEP]of[SEP]chinas[SEP]tujia[SEP]population	1790
indiana	1791
wisconsin	1792
iowa	1793
mart	1794
listed[SEP]owner[SEP]([SEP]s[SEP])	1795
250cc[SEP]winner	1796
indianapolis	1797
dayton	1798
tournament[SEP]location	1799
dates	1800
for	1801
palmeiras	1802
difference	1803
corinthians	1804
pa	1805
ontario	1806
w	1807
ends[SEP]won	1808
alabama	1809
no[SEP].[SEP]2	1810
round[SEP]3	1811
from	1812
round[SEP]5	1813
round[SEP]6[SEP]+	1814
double	1815
goal	1816
june	1817
july	1818
ypiranga[SEP]-[SEP]sp	1819
lms[SEP]nos[SEP].	1820
wheels	1821
279	1822
3f	1823
chi	1824
bonnie	1825
common[SEP]name	1826
accession[SEP]number	1827
similarity	1828
genus[SEP]/[SEP]species	1829
identity	1830
fifth[SEP]district	1831
third[SEP]district	1832
fourth[SEP]district	1833
second[SEP]district	1834
acquisition[SEP]via	1835
trade	1836
washington	1837
guard	1838
points[SEP]difference	1839
277	1840
race[SEP]2	1841
qualifying	1842
race[SEP]3	1843
race[SEP]1	1844
pos[SEP].	1845
rd	1846
jonathan[SEP]bomarito	1847
10:00[SEP]pm	1848
kpix	1849
ecozone	1850
ring[SEP]name	1851
current[SEP]rank	1852
birthplace	1853
nara	1854
debut	1855
stable	1856
kinship	1857
proto[SEP]-[SEP]austronesian	1858
proto[SEP]-[SEP]oceanic	1859
father	1860
proto[SEP]-[SEP]polynesian	1861
mass[SEP]([SEP]kg[SEP])	1862
143	1863
arkansas	1864
207	1865
102	1866
skip	1867
first[SEP]season	1868
2014	1869
october[SEP]11	1870
november[SEP]7	1871
november[SEP]14	1872
new[SEP]york[SEP]giants	1873
d14	1874
railway	1875
years[SEP]in[SEP]orlando	1876
date[SEP]of[SEP]issue	1877
printer	1878
interview[SEP]subject	1879
pictorials	1880
centerfold[SEP]model	1881
cover[SEP]model	1882
20[SEP]questions	1883
1600[SEP]kwh[SEP]/[SEP]kw[SEP]p[SEP]y	1884
5[SEP].[SEP]8	1885
4[SEP].[SEP]4	1886
rating[SEP]/[SEP]share[SEP]([SEP]18[SEP]-[SEP]49[SEP])	1887
58	1888
service[SEP]pattern	1889
platform	1890
southern	1891
frequency[SEP]([SEP]per[SEP]hour[SEP])	1892
line	1893
3[SEP]strokes	1894
runs[SEP]conceded	1895
wickets	1896
maidens	1897
368	1898
story	1899
last[SEP]meeting	1900
depaul	1901
current[SEP]streak	1902
sacramento	1903
59	1904
poll[SEP]winner	1905
advocate[SEP]#[SEP]1	1906
youtube	1907
original[SEP]artist	1908
order[SEP]#	1909
series[SEP]premiere	1910
alberta	1911
success[SEP]rate	1912
summary	1913
tied	1914
livery	1915
locomotive[SEP]type	1916
1870	1917
tv[SEP]broadcast	1918
january[SEP]9	1919
kurume	1920
japanese	1921
prefecture	1922
iwate	1923
chicago	1924
new[SEP]orleans	1925
february[SEP]18	1926
february[SEP]24	1927
content	1928
television[SEP]service	1929
package[SEP]/[SEP]option	1930
hdtv	1931
arte	1932
n°	1933
sky[SEP]famiglia	1934
dar	1935
16:9	1936
mydeejay	1937
ppv	1938
912	1939
204	1940
336	1941
cinema	1942
308	1943
333	1944
613	1945
best[SEP]bowling	1946
overs	1947
agricultural[SEP]use[SEP]([SEP]m[SEP]3[SEP]/[SEP]p[SEP]/[SEP]yr[SEP])[SEP]([SEP]in[SEP]%[SEP])	1948
372	1949
madrid[SEP]masters	1950
who[SEP]knows[SEP]the[SEP]most[SEP]about[SEP]the[SEP]guest[SEP]host[SEP]?[SEP]panelists	1951
musical[SEP]guest[SEP]([SEP]song[SEP]performed[SEP])	1952
guest[SEP]host	1953
validation	1954
iin[SEP]ranges	1955
active	1956
scenario	1957
effective[SEP]exhaust[SEP]velocity[SEP]([SEP]m[SEP]/[SEP]s[SEP])	1958
specific[SEP]impulse[SEP]([SEP]s[SEP])	1959
453	1960
harris	1961
1[SEP].[SEP]3[SEP]%	1962
centennial	1963
1988	1964
information	1965
s[SEP]no	1966
team[SEP]([SEP]b[SEP])	1967
match[SEP]date	1968
28[SEP].[SEP]5	1969
cartridge	1970
weatherby	1971
winchester	1972
bullet[SEP]weight	1973
muzzle[SEP]energy	1974
headphone[SEP]model	1975
us[SEP]msrp	1976
termination	1977
headphone[SEP]class	1978
earpads	1979
prestige	1980
0[SEP].[SEP]1	1981
office	1982
term[SEP]began	1983
term[SEP]ended	1984
new[SEP]orleans[SEP]saints	1985
18:00	1986
archive	1987
6[SEP].[SEP]6	1988
bills[SEP]first[SEP]downs	1989
baltimore[SEP]colts	1990
goals[SEP]scored	1991
television	1992
abc	1993
conference[SEP]matchups	1994
payout[SEP]([SEP]us[SEP]$[SEP])	1995
%[SEP]of[SEP]total[SEP]deportees	1996
iso	1997
pop[SEP].[SEP]density[SEP]people[SEP]/[SEP]km[SEP]2	1998
population[SEP]%[SEP]of[SEP]eu	1999
member[SEP]state	2000
slovakia	2001
1[SEP].[SEP]7[SEP]%	2002
area[SEP]km[SEP]2	2003
87	2004
greece	2005
tv3	2006
raiders	2007
wildcats	2008
wolves	2009
7[SEP].[SEP]0	2010
73	2011
aberdeen	2012
citrate	2013
voges[SEP]-[SEP]proskauer	2014
negative	2015
indole	2016
positive	2017
s07e04	2018
limoges	2019
2nd[SEP]place	2020
vehicle	2021
population[SEP]([SEP]2011[SEP])	2022
gdp[SEP]adjusted[SEP]([SEP]$[SEP]billions[SEP])	2023
population[SEP]([SEP]millions[SEP])	2024
492	2025
657	2026
text	2027
released[SEP]date	2028
western[SEP]title	2029
game[SEP]modes	2030
donor[SEP]payment	2031
children[SEP]per[SEP]donor	2032
belgium	2033
missouri[SEP]vs[SEP].	2034
at[SEP]neutral[SEP]site	2035
at[SEP]opponents[SEP]venue	2036
last[SEP]5[SEP]meetings	2037
367	2038
texas[SEP]tech	2039
series[SEP]sorted	2040
featuring	2041
peri	2042
362	2043
preliminary[SEP]average	2044
semifinal[SEP]average	2045
pop[SEP].[SEP]density[SEP]([SEP]per[SEP]km²[SEP])	2046
largest[SEP]city	2047
roskilde	2048
language[SEP]([SEP]s[SEP])	2049
217	2050
budapest	2051
points[SEP]won	2052
points[SEP]%	2053
5[SEP]strokes	2054
gross[SEP]sales	2055
sellout[SEP]([SEP]%[SEP])	2056
tickets[SEP]sold[SEP]/[SEP]available	2057
probable[SEP]future	2058
imperative	2059
past[SEP]habitual	2060
injunctive	2061
11[SEP].[SEP]1	2062
209	2063
bobcats	2064
flyers	2065
487	2066
traditional	2067
11[SEP].[SEP]8[SEP]([SEP]74[SEP])	2068
14[SEP].[SEP]12[SEP]([SEP]96[SEP])	2069
adelaide	2070
st[SEP]kilda	2071
footscray	2072
7[SEP].[SEP]8[SEP]([SEP]50[SEP])	2073
18[SEP].[SEP]12[SEP]([SEP]120[SEP])	2074
brisbane[SEP]lions	2075
fremantle	2076
private[SEP]/[SEP]catholic	2077
release[SEP]price[SEP]([SEP]usd[SEP])	2078
l2[SEP]cache	2079
kickoff	2080
dpi	2081
dimensions[SEP]([SEP]mm[SEP])	2082
product	2083
interface	2084
lexington	2085
volleyball	2086
madison	2087
golf	2088
soccer	2089
wooster	2090
cross[SEP]country	2091
softball	2092
basketball	2093
2011[SEP]-[SEP]12	2094
tennis	2095
ashland	2096
1773	2097
official[SEP]#	2098
british[SEP]columbia	2099
jeff[SEP]brown	2100
m[SEP]/[SEP]v[SEP]ft[SEP]/[SEP]s	2101
max[SEP].[SEP]height[SEP]([SEP]ft[SEP])	2102
shell[SEP]([SEP]lb[SEP])	2103
gun	2104
12[SEP].[SEP]5	2105
time[SEP]to[SEP]ft[SEP]([SEP]m[SEP])[SEP]at[SEP]55°[SEP]([SEP]seconds[SEP])	2106
france	2107
30[SEP]to[SEP]34	2108
treasurer	2109
shot[SEP]%	2110
switzerland	2111
oblast\age	2112
65[SEP]to[SEP]69	2113
50[SEP]to[SEP]54	2114
shanghai	2115
years[SEP]for[SEP]grizzlies	2116
miles[SEP]([SEP]km[SEP])	2117
june[SEP]7	2118
race[SEP]time	2119
duke	2120
missouri	2121
1999	2122
manager	2123
date[SEP]successor[SEP]seated	2124
reason[SEP]for[SEP]change	2125
date[SEP]of[SEP]death	2126
3rd[SEP]stage	2127
parameter	2128
archbishop	2129
ordained[SEP]bishop	2130
died	2131
210	2132
211	2133
303	2134
258	2135
production[SEP]([SEP]bbl[SEP]/[SEP]day[SEP])	2136
target	2137
brand[SEP]name	2138
antibody	2139
length[SEP]([SEP]m[SEP])	2140
455	2141
average[SEP]climb[SEP]([SEP]%[SEP])	2142
kilometer	2143
233	2144
stolen[SEP]ends[SEP]against	2145
154	2146
5000	2147
wicket	2148
pakistan	2149
bangladesh	2150
451	2151
sydney	2152
falcons[SEP]points	2153
3[SEP]-[SEP]2	2154
4[SEP]-[SEP]4	2155
6[SEP]-[SEP]4	2156
ktm	2157
driver[SEP]/[SEP]passenger	2158
tdp	2159
gpu[SEP]frequency	2160
memory	2161
june[SEP]11	2162
chennai	2163
hawks	2164
clay	2165
republican:[SEP]steve[SEP]sauerberg	2166
dates[SEP]administered	2167
poll[SEP]source	2168
democrat:[SEP]vivian[SEP]davis[SEP]figures	2169
lead[SEP]margin	2170
608	2171
686	2172
748	2173
632	2174
democrat:[SEP]carl[SEP]levin	2175
54[SEP]%	2176
latitude	2177
longitude	2178
bridgend	2179
team[SEP]#[SEP]2	2180
team[SEP]#[SEP]1	2181
name[SEP]origin	2182
diameter[SEP]([SEP]km[SEP])	2183
year[SEP]named	2184
great[SEP]britain	2185
round2	2186
212	2187
narrator	2188
profits[SEP]([SEP]billion[SEP]$[SEP])	2189
company	2190
sales[SEP]([SEP]billion[SEP]$[SEP])	2191
assets[SEP]([SEP]billion[SEP]$[SEP])	2192
china	2193
market[SEP]value[SEP]([SEP]billion[SEP]$[SEP])	2194
ai	2195
industry	2196
netherlands	2197
numeral	2198
election	2199
mouse	2200
host[SEP]([SEP]s[SEP])	2201
prime	2202
website	2203
car[SEP]#	2204
year[SEP]started	2205
nickerie	2206
marowijne	2207
coronie	2208
para	2209
flaps	2210
24[SEP].[SEP]8	2211
population[SEP]([SEP]2010[SEP])	2212
labrador	2213
equipment	2214
bike[SEP]no	2215
394	2216
593	2217
380	2218
chester	2219
religion	2220
hindu	2221
air[SEP]dates	2222
05	2223
vote	2224
immunity	2225
new[SEP]/[SEP]returning[SEP]/[SEP]same[SEP]network	2226
previous[SEP]network	2227
show	2228
retitled[SEP]as[SEP]/[SEP]same	2229
last[SEP]aired	2230
190	2231
saka[SEP]era	2232
in[SEP]malayalam	2233
sign[SEP]of[SEP]zodiac	2234
gemini	2235
miami	2236
milwaukee	2237
vacuum[SEP]range	2238
nightly[SEP]rank	2239
episode[SEP]number[SEP]production[SEP]number	2240
hanyu	2241
tongyong	2242
pixels	2243
88	2244
november[SEP]2	2245
november[SEP]21	2246
april[SEP]7	2247
february[SEP]10	2248
december[SEP]6	2249
january[SEP]2	2250
phoenix	2251
april[SEP]3	2252
q1[SEP]order	2253
alexander[SEP]wurz	2254
14th	2255
bike[SEP]([SEP]40[SEP]km[SEP])	2256
58:20	2257
total[SEP]time	2258
swim[SEP]([SEP]1[SEP].[SEP]5[SEP]km[SEP])	2259
december[SEP]29	2260
preliminary	2261
official[SEP]name	2262
march[SEP]27[SEP]-[SEP]29	2263
november[SEP]3	2264
133	2265
january[SEP]15[SEP]-[SEP]16	2266
location[SEP]/[SEP]attendance	2267
july[SEP]18	2268
july[SEP]1	2269
team[SEP]1	2270
team[SEP]2	2271
man[SEP]of[SEP]the[SEP]match	2272
best[SEP]15[SEP]-[SEP]year[SEP]period	2273
fischer	2274
l1	2275
farmers	2276
projects	2277
department	2278
19th	2279
24th	2280
swindon[SEP]wildcats	2281
702	2282
22nd	2283
21[SEP]st	2284
census[SEP]ranking	2285
284	2286
1209	2287
method	2288
ha	2289
geneva	2290
output	2291
1902	2292
south[SEP]asians[SEP]2001	2293
%[SEP]2001	2294
pakistanis[SEP]admitted	2295
nepalis[SEP]admitted	2296
627	2297
sri[SEP]lankans[SEP]admitted	2298
going[SEP]to	2299
departure	2300
grid	2301
time[SEP]/[SEP]retired	2302
car[SEP]no[SEP].	2303
fin[SEP].[SEP]pos	2304
equation	2305
2nd[SEP]throw	2306
botafogo	2307
vitória	2308
january[SEP]19	2309
cleveland	2310
round[SEP]of[SEP]16	2311
singles	2312
did[SEP]not[SEP]advance	2313
quarterfinals	2314
opponents[SEP]in[SEP]the[SEP]final	2315
upstream	2316
downstream	2317
bandwidth	2318
consumer[SEP]price[SEP]index[SEP]([SEP]2005[SEP]=[SEP]100[SEP])	2319
miami[SEP]dolphins	2320
max[SEP]pressure	2321
gs	2322
assists	2323
157	2324
orlando	2325
laps[SEP]led	2326
february[SEP]11	2327
denver	2328
april[SEP]5	2329
december[SEP]17	2330
houston	2331
69	2332
december[SEP]13	2333
november[SEP]26	2334
sacked	2335
1391[SEP]carelia	2336
johnson	2337
90	2338
december[SEP]10	2339
not[SEP]nominated	2340
may[SEP]25	2341
2[SEP]-[SEP]3	2342
november[SEP]17	2343
november[SEP]5	2344
256	2345
points[SEP]2	2346
shirt[SEP]sponsor	2347
team[SEP]captain	2348
december[SEP]27	2349
december[SEP]11	2350
college[SEP]/[SEP]junior[SEP]/[SEP]club[SEP]team[SEP]([SEP]league[SEP])	2351
left[SEP]wing	2352
boston[SEP]celtics	2353
english[SEP]translation	2354
qualification	2355
experience	2356
1250	2357
300	2358
alaska	2359
california	2360
tennessee	2361
2[SEP]-[SEP]5	2362
semifinals	2363
winter[SEP]olympics	2364
fis[SEP]nordic[SEP]world[SEP]ski[SEP]champions	2365
holmenkollen	2366
part[SEP]4	2367
part[SEP]3	2368
verb[SEP]meaning	2369
part[SEP]1	2370
gelopen	2371
part[SEP]2	2372
band	2373
3b	2374
heldu	2375
7b	2376
96	2377
cebu	2378
eagle[SEP]riders	2379
gatchaman	2380
pregame[SEP]host	2381
espn	2382
pregame[SEP]analysts	2383
sideline[SEP]reporters	2384
play[SEP]-[SEP]by[SEP]-[SEP]play	2385
champions[SEP]league	2386
6[SEP].[SEP]0	2387
copa[SEP]del[SEP]rey	2388
410	2389
bonus[SEP]points	2390
385	2391
level	2392
15[SEP].[SEP]5	2393
republican:[SEP]joe[SEP]kenney	2394
28[SEP]%	2395
democrat:[SEP]jay[SEP]nixon	2396
43[SEP]%	2397
scientific[SEP]name	2398
domestic[SEP]mail	2399
260	2400
international[SEP]mail	2401
kerry%	2402
transfer[SEP]window	2403
moving[SEP]from	2404
crystal[SEP]palace	2405
gk	2406
everton	2407
opposition	2408
1[SEP]st	2409
771	2410
br[SEP]no[SEP].	2411
fulham	2412
age	2413
618	2414
may[SEP]29	2415
number[SEP]of[SEP]clubs	2416
shandong	2417
109	2418
642	2419
viewership	2420
john[SEP]sullivan	2421
romania	2422
959	2423
191	2424
+[SEP]1[SEP]lap	2425
make	2426
goal[SEP]difference	2427
+[SEP]10	2428
points[SEP]1	2429
average[SEP]speed[SEP]([SEP]mph[SEP])	2430
chip[SEP]ganassi[SEP]racing	2431
228	2432
tie[SEP]no	2433
chelsea	2434
leeds[SEP]united	2435
burnley	2436
1975	2437
6[SEP]–[SEP]4[SEP],[SEP]6[SEP]–[SEP]4	2438
final[SEP]television[SEP]commentator	2439
per­cent­age	2440
abbre­viation	2441
nor	2442
constellation	2443
6[SEP].[SEP]4	2444
16[SEP]mm[SEP]t[SEP]/[SEP]r	2445
1:55:13	2446
morris	2447
precincts	2448
number[SEP]of[SEP]fixtures	2449
new[SEP]entries[SEP]this[SEP]round	2450
actor[SEP]required	2451
actor[SEP]in[SEP]original[SEP]production	2452
flatspin	2453
roleplay	2454
church[SEP]name	2455
location[SEP]of[SEP]the[SEP]church	2456
stavang	2457
sub[SEP]-[SEP]parish[SEP]([SEP]sokn[SEP])	2458
eikefjord	2459
1957	2460
parish[SEP]([SEP]prestegjeld[SEP])	2461
seasons	2462
poland	2463
turquoise	2464
sub[SEP]-[SEP]parish[SEP]([SEP]sogn[SEP])	2465
fortun	2466
jostedal	2467
1908	2468
25:12	2469
kožuf	2470
2007[SEP]–[SEP]08	2471
milano	2472
spacecraft	2473
lc34	2474
flights	2475
launcher	2476
project	2477
71	2478
maximum[SEP]diameter	2479
outgoing[SEP]manage	2480
incoming[SEP]manager	2481
0[SEP]–[SEP]100[SEP]km[SEP]/[SEP]h[SEP],[SEP]s	2482
top[SEP]speed	2483
co[SEP]2	2484
volume	2485
150	2486
0[SEP]-[SEP]2	2487
newell[SEP]'[SEP]s[SEP]old[SEP]boys	2488
chinese[SEP]name	2489
romanised[SEP]name	2490
105	2491
3[SEP]-[SEP]4	2492
instituto	2493
1990[SEP]-[SEP]1991	2494
122	2495
borough[SEP]or[SEP]census[SEP]area	2496
at[SEP]los[SEP]angeles[SEP]rams	2497
arrowhead[SEP]stadium	2498
story[SEP]no[SEP].	2499
uk[SEP]viewers[SEP]([SEP]million[SEP])	2500
goals[SEP]conceded	2501
loses	2502
june[SEP]22	2503
save	2504
genitive	2505
morocco	2506
state[SEP]([SEP]class[SEP])	2507
iata[SEP]code	2508
passengers	2509
alma[SEP]mater	2510
jfk	2511
ord	2512
tonnes	2513
standard[SEP]order	2514
traditional[SEP]chinese	2515
abbr[SEP].	2516
zodiac[SEP]sign	2517
transcription	2518
thai[SEP]name	2519
sanskrit[SEP]word	2520
red	2521
venus	2522
year[SEP]to[SEP]april	2523
revenue[SEP]([SEP]us[SEP]$[SEP]million[SEP])	2524
ebit[SEP]([SEP]us[SEP]$[SEP]m[SEP])	2525
net[SEP]profit[SEP]([SEP]us[SEP]$[SEP]m[SEP])	2526
earnings[SEP]per[SEP]share[SEP]([SEP]¢[SEP])	2527
metronome	2528
developer	2529
function	2530
cospar[SEP]id	2531
satellite	2532
charter[SEP]date	2533
greek[SEP]designation	2534
tampa	2535
piston	2536
minneapolis	2537
burglary	2538
robbery	2539
mitchell	2540
value	2541
676	2542
afinsa	2543
scott	2544
639	2545
order	2546
distance[SEP]([SEP]ly[SEP])	2547
arrival[SEP]date	2548
digital[SEP]terrestrial[SEP]channel	2549
pageant	2550
substrate	2551
enzyme	2552
binibining[SEP]pilipinas[SEP]-[SEP]international	2553
miss[SEP]universe[SEP]philippines	2554
second[SEP]runner[SEP]-[SEP]up	2555
binibining[SEP]pilipinas[SEP]-[SEP]world	2556
earnings[SEP]per[SEP]share[SEP]([SEP]p[SEP])	2557
commune	2558
2002[SEP]population	2559
resolution	2560
436	2561
sports	2562
schools	2563
zug	2564
cover[SEP]date	2565
story[SEP]title	2566
sesamin	2567
foodstuff	2568
440	2569
clubs[SEP]remaining	2570
winners[SEP]from[SEP]previous[SEP]round	2571
no[SEP].[SEP]overall	2572
mlb[SEP]team	2573
fcsl[SEP]team	2574
music	2575
macedonian	2576
bulgarian	2577
dutch	2578
canadian[SEP]viewers[SEP]([SEP]million[SEP])	2579
306	2580
301	2581
median[SEP]house[SEP]-[SEP]hold[SEP]income	2582
serial[SEP]no[SEP].	2583
city[SEP]area[SEP]([SEP]km[SEP]2[SEP])	2584
s[SEP]barangay	2585
wrestler	2586
eliminated[SEP]by	2587
cincinnati	2588
channel[SEP]([SEP]tv[SEP]/[SEP]rf[SEP])	2589
rnag[SEP]([SEP]mhz[SEP])	2590
transmitter	2591
album	2592
u[SEP].[SEP]s[SEP].[SEP]viewers[SEP]([SEP]in[SEP]millions[SEP])	2593
commentator	2594
broadcaster	2595
spokespersons	2596
voting[SEP]order	2597
luxembourg	2598
cardinals	2599
23:55	2600
el[SEP]canal[SEP]de[SEP]las[SEP]estrellas	2601
october[SEP]20[SEP],[SEP]2008	2602
mexico	2603
trinidad	2604
date[SEP]premiered[SEP]([SEP]2009[SEP])	2605
u[SEP].[SEP]s[SEP].[SEP]acres[SEP]episode	2606
garfield[SEP]episode[SEP]1	2607
garfield[SEP]episode[SEP]2	2608
robodie	2609
colombia	2610
corrected[SEP]time[SEP]d:hh:mm:ss	2611
aus70	2612
leagues[SEP]entering[SEP]at[SEP]this[SEP]round	2613
township	2614
land[SEP]([SEP]sqmi[SEP])	2615
water[SEP]([SEP]sqmi[SEP])	2616
geo[SEP]id	2617
logan	2618
lansing	2619
pop[SEP].[SEP]([SEP]2010[SEP])	2620
ansi[SEP]code	2621
malcolm	2622
reed	2623
geographical[SEP]regions	2624
contestant	2625
province[SEP],[SEP]community	2626
baoruco	2627
toronto	2628
1955	2629
quality	2630
sanskrit	2631
gloss	2632
twins	2633
actor[SEP]/[SEP]actress	2634
best[SEP]supporting[SEP]actress	2635
2001[SEP]/[SEP]02	2636
2003[SEP]/[SEP]04	2637
5[SEP].[SEP]7	2638
2005[SEP]/[SEP]06	2639
2007[SEP]/[SEP]08	2640
2006[SEP]/[SEP]07	2641
0[SEP].[SEP]5	2642
ethnic[SEP]group	2643
horizontal[SEP]bar	2644
rings	2645
parallel[SEP]bars	2646
vault	2647
floor	2648
jerseys	2649
upper[SEP]index[SEP]kcal[SEP]/[SEP]nm[SEP]3	2650
lower[SEP]index[SEP]mj[SEP]/[SEP]nm[SEP]3	2651
fuel[SEP]gas	2652
upper[SEP]index[SEP]mj[SEP]/[SEP]nm[SEP]3	2653
qb[SEP]rating	2654
leagues	2655
54[SEP].[SEP]0	2656
rider	2657
horse	2658
record[SEP]label	2659
other[SEP]details	2660
series[SEP]episode	2661
33rd	2662
other[SEP]mozilla	2663
safari	2664
firefox	2665
internet[SEP]explorer	2666
74	2667
watford	2668
july[SEP]26	2669
23rd	2670
stage[SEP]wins	2671
tv[SEP]network[SEP]([SEP]s[SEP])	2672
weekly[SEP]schedule	2673
mult[SEP].	2674
bills[SEP]originally[SEP]cosponsored	2675
all[SEP]amendments[SEP]cosponsored	2676
all[SEP]bills[SEP]cosponsored	2677
all[SEP]bills[SEP]sponsored	2678
cr[SEP]no[SEP].	2679
withdrawn	2680
new[SEP]england[SEP]patriots	2681
dolphins[SEP]points	2682
lead	2683
ga	2684
t	2685
sol	2686
gf	2687
serial	2688
7[SEP]-[SEP]1	2689
june[SEP]16	2690
career	2691
best	2692
col[SEP]([SEP]m[SEP])	2693
island	2694
prominence[SEP]([SEP]m[SEP])	2695
album[SEP]#	2696
label	2697
chinese[SEP]([SEP]traditional[SEP])	2698
chinese[SEP]([SEP]simplified[SEP])	2699
samples[SEP]taken	2700
producer	2701
cdr*	2702
life[SEP]expectancy[SEP]total	2703
imr*	2704
tfr*	2705
nc*	2706
size[SEP]([SEP]cents[SEP])	2707
560	2708
just[SEP]ratio	2709
